Repository: alhabib3031/StudentResidenceManagementSystemSRMS
Catalog: SRMS.WebUI.Server/Resources/Resource.*.resx
Languages: ar_ly

# ForgotPassword_Success_Spam
source: Didn't receive the email? Check your spam folder or try again.
ar_ly: لم تستلم البريد الإلكتروني؟ تحقق من مجلد الرسائل غير المرغوب فيها أو حاول مرة أخرى.

# ForgotPassword_Button_TryAnotherEmail
source: Try another email
ar_ly: جرب بريدًا إلكترونيًا آخر

# ForgotPassword_Snackbar_Success
source: Password reset link sent successfully! Please check your email.
ar_ly: تم إرسال رابط إعادة تعيين كلمة المرور بنجاح! يرجى التحقق من بريدك الإلكتروني.

# ForgotPassword_Snackbar_Failure
source: Failed to send reset link. Please try again.
ar_ly: فشل إرسال رابط إعادة التعيين. يرجى المحاولة مرة أخرى.

# ForgotPassword_Snackbar_Error
source: An error occurred: {0}
ar_ly: حدث خطأ: {0}

# ResetPassword_PasswordStrength_VeryWeak
source: Very Weak
ar_ly: ضعيف جداً

# ResetPassword_PasswordStrength_Weak
source: Weak
ar_ly: ضعيف

# ResetPassword_PasswordStrength_Fair
source: Fair
ar_ly: مقبول

# ResetPassword_PasswordStrength_Good
source: Good
ar_ly: جيد

# ResetPassword_PasswordStrength_Strong
source: Strong
ar_ly: قوي

# Profile_PageTitle
source: My Profile - SRMS
ar_ly: ملفي الشخصي - SRMS

# Profile_Header
source: My Profile
ar_ly: ملفي الشخصي

# Profile_Error_Load
source: Could not load profile data. Please try again.
ar_ly: تعذر تحميل بيانات الملف الشخصي. يرجى المحاولة مرة أخرى.

# Profile_Status_Active
source: Active
ar_ly: نشط

# Profile_Status_Inactive
source: Inactive
ar_ly: غير نشط

# Profile_MemberSince
source: Member since
ar_ly: عضو منذ

# Profile_LastLogin
source: Last login
ar_ly: آخر تسجيل دخول

# Profile_Never
source: Never
ar_ly: أبداً

# Profile_Roles
source: Roles
ar_ly: الأدوار

# Profile_Tab_PersonalInfo
source: Personal Info
ar_ly: المعلومات الشخصية

# Profile_Label_FirstName
source: First Name
ar_ly: الاسم الأول

# Profile_Label_LastName
source: Last Name
ar_ly: اسم العائلة

# Profile_Label_Email
source: Email
ar_ly: البريد الإلكتروني

# Profile_Label_PhoneNumber
source: Phone Number
ar_ly: رقم الهاتف

# Profile_Label_City
source: City
ar_ly: المدينة

# Profile_Label_Country
source: Country
ar_ly: الدولة

# Profile_Label_Street
source: Street Address
ar_ly: عنوان الشارع

# Profile_Label_PostalCode
source: Postal Code
ar_ly: الرمز البريدي

# Profile_Label_PreferredLanguage
source: Preferred Language
ar_ly: اللغة المفضلة

# Profile_Button_Saving
source: Saving...
ar_ly: جارٍ الحفظ...

# Profile_Button_SaveChanges
source: Save Changes
ar_ly: حفظ التغييرات

# Profile_Tab_Security
source: Security
ar_ly: الأمان

# Profile_Label_CurrentPassword
source: Current Password
ar_ly: كلمة المرور الحالية

# Profile_Label_NewPassword
source: New Password
ar_ly: كلمة المرور الجديدة

# Profile_Label_ConfirmNewPassword
source: Confirm New Password
ar_ly: تأكيد كلمة المرور الجديدة

# Profile_Button_Changing
source: Changing...
ar_ly: جارٍ التغيير...

# Profile_Button_ChangePassword
source: Change Password
ar_ly: تغيير كلمة المرور

# Profile_Tab_Preferences
source: Preferences
ar_ly: التفضيلات

# Profile_Label_EmailNotifications
source: Email Notifications
ar_ly: إشعارات البريد الإلكتروني

# Profile_Helper_EmailNotifications
source: Receive email notifications for important updates
ar_ly: تلقي إشعارات البريد الإلكتروني للتحديثات الهامة

# Profile_Label_SMSNotifications
source: SMS Notifications
ar_ly: إشعارات الرسائل القصيرة

# Profile_Helper_SMSNotifications
source: Receive SMS notifications for urgent matters
ar_ly: تلقي إشعارات الرسائل القصيرة للأمور العاجلة

# Profile_Label_Theme
source: Theme
ar_ly: المظهر

# Profile_Theme_Light
source: Light
ar_ly: فاتح

# Profile_Theme_Dark
source: Dark
ar_ly: داكن

# Profile_Theme_Auto
source: Auto
ar_ly: تلقائي

# Profile_Button_SavePreferences
source: Save Preferences
ar_ly: حفظ التفضيلات

# Profile_Snackbar_UpdateSuccess
source: Profile updated successfully!
ar_ly: تم تحديث الملف الشخصي بنجاح!

# Profile_Snackbar_UpdateFailed
source: Failed to update profile.
ar_ly: فشل تحديث الملف الشخصي.

# Profile_Snackbar_PasswordMismatch
source: Passwords do not match!
ar_ly: كلمات المرور غير متطابقة!

# Profile_Snackbar_PasswordChangeNotImplemented
source: Password change feature will be implemented soon!
ar_ly: سيتم تنفيذ ميزة تغيير كلمة المرور قريبًا!

# Profile_Snackbar_UploadNotImplemented
source: Image upload feature coming soon!
ar_ly: ميزة تحميل الصور ستتوفر قريبًا!

source: SMS Notifications
ar_ly: إشعارات الرسائل القصيرة

# Desc_SMSNotifications
source: Receive important notifications via SMS.
ar_ly: تلقي الإشعارات الهامة عبر الرسائل القصيرة.

source: Push Notifications
ar_ly: إشعارات الدفع

# Desc_PushNotifications
source: Get push notifications on your device.
ar_ly: الحصول على إشعارات الدفع على جهازك.

source: Payment Notifications
ar_ly: إشعارات الدفع

# Desc_PaymentNotifications
source: Receive notifications for payments and invoices.
ar_ly: تلقي إشعارات للمدفوعات والفواتير.

source: Complaint Notifications
ar_ly: إشعارات الشكاوى

# Desc_ComplaintNotifications
source: Get updates on your complaints.
ar_ly: الحصول على تحديثات حول شكاواك.

source: Dark Mode
ar_ly: الوضع الداكن

source: Compact Mode
ar_ly: الوضع المضغوط

source: Accent Color
ar_ly: لون التمييز

source: Purple
ar_ly: بنفسجي

source: Blue
ar_ly: أزرق

source: Green
ar_ly: أخضر

source: Red
ar_ly: أحمر

source: Two-Factor Authentication
ar_ly: المصادقة الثنائية

# Desc_TwoFactorAuthentication
source: Add an extra layer of security to your account.
ar_ly: أضف طبقة إضافية من الأمان إلى حسابك.

source: Login Alerts
ar_ly: تنبيهات تسجيل الدخول

# Desc_LoginAlerts
source: Get notified when your account is logged in from a new device.
ar_ly: احصل على إشعار عند تسجيل الدخول إلى حسابك من جهاز جديد.

source: Public Profile
ar_ly: الملف الشخصي العام

# Desc_PublicProfile
source: Allow other users to see your profile.
ar_ly: السماح للمستخدمين الآخرين برؤية ملفك الشخصي.

source: View Login History
ar_ly: عرض سجل تسجيل الدخول

# LogoutAllDevices
source: Logout From All Devices
ar_ly: تسجيل الخروج من جميع الأجهزة

# Snackbar_GeneralSettingsSaved
source: General settings saved successfully!
ar_ly: تم حفظ الإعدادات العامة بنجاح!

# Snackbar_NotificationSettingsSaved
source: Notification settings saved successfully!
ar_ly: تم حفظ إعدادات الإشعارات بنجاح!

# Snackbar_AppearanceSettingsSaved
source: Appearance settings saved successfully!
ar_ly: تم حفظ إعدادات المظهر بنجاح!

# Snackbar_LoginHistoryComingSoon
source: Login history feature coming soon!
ar_ly: ميزة سجل تسجيل الدخول ستتوفر قريبًا!

# Snackbar_LoggedOutAllDevices
source: Successfully logged out of all other devices.
ar_ly: تم تسجيل الخروج بنجاح من جميع الأجهزة الأخرى.

# Snackbar_DataExportStarted
source: Data export started. You will receive an email with the download link shortly.
ar_ly: بدأ تصدير البيانات. ستتلقى بريدًا إلكترونيًا يحتوي على رابط التنزيل قريبًا.

# Snackbar_CacheCleared
source: Cache cleared successfully!
ar_ly: تم مسح ذاكرة التخزين المؤقت بنجاح!

# Snackbar_DeleteAccount_ContactSupport
source: To delete your account, please contact support.
ar_ly: لحذف حسابك، يرجى الاتصال بالدعم.

# Notifications_PageTitle
source: Notifications - SRMS
ar_ly: الإشعارات - SRMS

# Notifications_Header
source: Notifications
ar_ly: الإشعارات

# Notifications_Subheader
source: Stay up-to-date with your latest activities
ar_ly: ابق على اطلاع بآخر أنشطتك

# Notifications_Button_Create
source: Create Notification
ar_ly: إنشاء إشعار

# Notifications_Button_MarkAllRead
source: Mark All as Read
ar_ly: وضع علامة على الكل كمقروء

# Notifications_Filter_All
source: All
ar_ly: الكل

# Notifications_Filter_Unread
source: Unread
ar_ly: غير مقروء

# Notifications_Filter_Announcement
source: Announcement
ar_ly: إعلان

# Notifications_Filter_Info
source: Info
ar_ly: معلومات

# Notifications_Filter_Warning
source: Warning
ar_ly: تحذير

# Notifications_Filter_System
source: System
ar_ly: النظام

# Notifications_Filter_Payments
source: Payments
ar_ly: المدفوعات

# Notifications_Filter_Complaints
source: Complaints
ar_ly: الشكاوى

# Notifications_NoNotifications_Header
source: No Notifications
ar_ly: لا توجد إشعارات

# Notifications_NoNotifications_Subheader
source: You're all caught up! Check back later for updates.
ar_ly: أنت على ما يرام! تحقق مرة أخرى لاحقًا للحصول على التحديثات.

# Notifications_Snackbar_SentSuccess
source: Notification sent successfully
ar_ly: تم إرسال الإشعار بنجاح

# Notifications_Snackbar_SentFailed
source: Failed to send notification
ar_ly: فشل إرسال الإشعار

# AdminDashboard_PageTitle
source: Admin Dashboard
ar_ly: لوحة تحكم المسؤول

# AdminDashboard_Welcome
source: Welcome back, {0}
ar_ly: مرحبًا بعودتك، {0}

# AdminDashboard_Role
source: Administrator
ar_ly: مسؤول

# AdminDashboard_TotalResidences
source: Total Residences
ar_ly: إجمالي المساكن

# AdminDashboard_ResidencesGrowth
source: {0} this month
ar_ly: {0} هذا الشهر

# AdminDashboard_ActiveManagers
source: Active Managers
ar_ly: المديرون النشطون

# AdminDashboard_ManagerAvailability
source: {0}% availability
ar_ly: {0}٪؜ توفر

# AdminDashboard_TotalStudents
source: Total Students
ar_ly: إجمالي الطلاب

# AdminDashboard_OccupancyRate
source: {0}% occupancy
ar_ly: {0}٪؜ إشغال

# AdminDashboard_MonthlyRevenue
source: Monthly Revenue
ar_ly: الإيرادات الشهرية

# AdminDashboard_RevenueGrowth
source: {0}% vs last month
ar_ly: {0}٪؜ مقابل الشهر الماضي

# AdminDashboard_StudentRegistrations
source: Student Registration Trend
ar_ly: اتجاه تسجيل الطلاب

# AdminDashboard_Chart_ThisWeek
source: This Week
ar_ly: هذا الأسبوع

# AdminDashboard_Chart_ThisMonth
source: This Month
ar_ly: هذا الشهر

# AdminDashboard_Chart_ThisYear
source: This Year
ar_ly: هذه السنة

# AdminDashboard_Chart_NoData
source: No data available for the selected period
ar_ly: لا توجد بيانات متاحة للفترة المحددة

# AdminDashboard_QuickActions
source: Quick Actions
ar_ly: إجراءات سريعة

# AdminDashboard_Button_AddResidence
source: Add Residence
ar_ly: إضافة سكن

# AdminDashboard_Button_AddManager
source: Add Manager
ar_ly: إضافة مدير

# AdminDashboard_Button_ViewReports
source: View Reports
ar_ly: عرض التقارير

# AdminDashboard_Button_SystemSettings
source: System Settings
ar_ly: إعدادات النظام

# AdminDashboard_ComplaintsOverview
source: Complaints Overview
ar_ly: نظرة عامة على الشكاوى

# AdminDashboard_Complaints_Pending
source: Pending
ar_ly: قيد الانتظار

# AdminDashboard_Complaints_Resolved
source: Resolved
ar_ly: تم حلها

# AdminDashboard_Button_ViewAllComplaints
source: View All Complaints
ar_ly: عرض جميع الشكاوى

# ManagersManagement_PageTitle
source: Managers Management
ar_ly: إدارة المديرين

# ManagersManagement_Header
source: Managers Management
ar_ly: إدارة المديرين

# ManagersManagement_Button_Add
source: Add New Manager
ar_ly: إضافة مدير جديد

# ManagersManagement_Stats_Total
source: Total Managers
ar_ly: إجمالي المديرين

# ManagersManagement_Stats_Active
source: Active Managers
ar_ly: المديرون النشطون

# ManagersManagement_Stats_OnLeave
source: On Leave
ar_ly: في إجازة

# ManagersManagement_Stats_AvgWorkload
source: Avg. Workload
ar_ly: متوسط عبء العمل

# ManagersManagement_SearchPlaceholder
source: Search managers by name, email, or employee #...
ar_ly: البحث عن مديرين بالاسم أو البريد الإلكتروني أو رقم الموظف ...

# ManagersManagement_Filter_Status
source: Status
ar_ly: الحالة

# ManagersManagement_Filter_AllStatuses
source: All Statuses
ar_ly: جميع الحالات

# ManagersManagement_Filter_Active
source: Active
ar_ly: نشط

# ManagersManagement_Filter_OnLeave
source: On Leave
ar_ly: في إجازة

# ManagersManagement_Filter_Suspended
source: Suspended
ar_ly: موقوف

# ManagersManagement_Filter_Terminated
source: Terminated
ar_ly: منتهية خدمته

# ManagersManagement_Button_ClearFilters
source: Clear Filters
ar_ly: مسح الفلاتر

# ManagersManagement_Table_Header_Manager
source: Manager
ar_ly: المدير

# ManagersManagement_Table_Header_Contact
source: Contact
ar_ly: الاتصال

# ManagersManagement_Table_Header_EmployeeNo
source: Employee #
ar_ly: رقم الموظف

# ManagersManagement_Table_Header_Residences
source: Residences
ar_ly: المساكن

# ManagersManagement_Table_Header_Students
source: Students
ar_ly: الطلاب

# ManagersManagement_Table_Header_HireDate
source: Hire Date
ar_ly: تاريخ التعيين

# ManagersManagement_Table_Header_Status
source: Status
ar_ly: الحالة

# ManagersManagement_Table_Header_Actions
source: Actions
ar_ly: الإجراءات

# ManagersManagement_Table_NA
source: N/A
ar_ly: غير متاح

# ManagersManagement_Actions_ViewDetails
source: View Details
ar_ly: عرض التفاصيل

# ManagersManagement_Actions_Edit
source: Edit
ar_ly: تعديل

# ManagersManagement_Actions_AssignResidences
source: Assign Residences
ar_ly: تعيين مساكن

# ManagersManagement_Actions_SetOnLeave
source: Set On Leave
ar_ly: تعيين في إجازة

# ManagersManagement_Actions_SetActive
source: Set Active
ar_ly: تعيين نشط

# ManagersManagement_Actions_Delete
source: Delete
ar_ly: حذف

# ManagersManagement_Performance_Header
source: Managers Performance Overview
ar_ly: نظرة عامة على أداء المديرين

# ManagersManagement_Performance_AvgOccupancy
source: Avg. Occupancy
ar_ly: متوسط الإشغال

# ManagersManagement_Performance_Workload
source: Workload
ar_ly: عبء العمل

# ResidencesManagement_PageTitle
source: Residences Management
ar_ly: إدارة المساكن

# ResidencesManagement_Header
source: Residences Management
ar_ly: إدارة المساكن

# ResidencesManagement_Button_Add
source: Add New Residence
ar_ly: إضافة سكن جديد

# ResidencesManagement_Stats_Total
source: Total Residences
ar_ly: إجمالي المساكن

# ResidencesManagement_Stats_Capacity
source: Total Capacity
ar_ly: إجمالي السعة

# ResidencesManagement_Stats_Available
source: Available Space
ar_ly: المساحة المتاحة

# ResidencesManagement_Stats_AvgOccupancy
source: Avg. Occupancy
ar_ly: متوسط الإشغال

# ResidencesManagement_SearchPlaceholder
source: Search residences...
ar_ly: البحث عن مساكن...

# ResidencesManagement_Filter_Status
source: Status
ar_ly: الحالة

# ResidencesManagement_Filter_AllStatuses
source: All Statuses
ar_ly: جميع الحالات

# ResidencesManagement_Filter_Active
source: Active
ar_ly: نشط

# ResidencesManagement_Filter_Full
source: Full
ar_ly: ممتلئ

# ResidencesManagement_Filter_Available
source: Available
ar_ly: متاح

# ResidencesManagement_Button_ClearFilters
source: Clear Filters
ar_ly: مسح الفلاتر

# ResidencesManagement_Table_Header_Name
source: Name
ar_ly: الاسم

# ResidencesManagement_Table_Header_Location
source: Location
ar_ly: الموقع

# ResidencesManagement_Table_Header_Manager
source: Manager
ar_ly: المدير

# ResidencesManagement_Table_Header_Capacity
source: Capacity
ar_ly: السعة

# ResidencesManagement_Table_Header_Occupancy
source: Occupancy
ar_ly: الإشغال

# ResidencesManagement_Table_Header_MonthlyRent
source: Monthly Rent
ar_ly: الإيجار الشهري

# ResidencesManagement_Table_Header_Status
source: Status
ar_ly: الحالة

# ResidencesManagement_Table_Header_Actions
source: Actions
ar_ly: الإجراءات

# ResidencesManagement_Table_Unassigned
source: Unassigned
ar_ly: غير معين

# ResidencesManagement_Table_NA
source: N/A
ar_ly: غير متاح

# ResidencesManagement_Table_Status_Full
source: Full
ar_ly: ممتلئ

# ResidencesManagement_Table_Status_Active
source: Active
ar_ly: نشط

# ResidencesManagement_Table_Status_Inactive
source: Inactive
ar_ly: غير نشط

# ResidencesManagement_Actions_ViewDetails
source: View Details
ar_ly: عرض التفاصيل

# ResidencesManagement_Actions_Edit
source: Edit
ar_ly: تعديل

# ResidencesManagement_Actions_ManageRooms
source: Manage Rooms
ar_ly: إدارة الغرف

# ResidencesManagement_Actions_Delete
source: Delete
ar_ly: حذف

# ResidencesManagement_Snackbar_Created
source: Residence created successfully
ar_ly: تم إنشاء السكن بنجاح

# ResidencesManagement_Snackbar_Deleted
source: Residence '{0}' deleted successfully
ar_ly: تم حذف السكن '{0}' بنجاح

# ResidencesManagement_Dialog_ConfirmDelete_Title
source: Confirm Deletion
ar_ly: تأكيد الحذف

# ResidencesManagement_Dialog_ConfirmDelete_Content
source: Are you sure you want to delete '{0}'? This action cannot be undone.
ar_ly: هل أنت متأكد أنك تريد حذف '{0}'؟ لا يمكن التراجع عن هذا الإجراء.

# ResidencesManagement_Dialog_ConfirmDelete_Button
source: Delete
ar_ly: حذف

# ReportsAndAnalytics_PageTitle
source: Reports & Analytics
ar_ly: التقارير والتحليلات

# ReportsAndAnalytics_Header
source: Reports & Analytics
ar_ly: التقارير والتحليلات

# ReportsAndAnalytics_Button_ExportPDF
source: Export PDF
ar_ly: تصدير PDF

# ReportsAndAnalytics_Button_ExportExcel
source: Export Excel
ar_ly: تصدير Excel

# ReportsAndAnalytics_Label_StartDate
source: Start Date
ar_ly: تاريخ البدء

# ReportsAndAnalytics_Label_EndDate
source: End Date
ar_ly: تاريخ الانتهاء

# ReportsAndAnalytics_Label_QuickSelect
source: Quick Select
ar_ly: اختيار سريع

# ReportsAndAnalytics_Period_Today
source: Today
ar_ly: اليوم

# ReportsAndAnalytics_Period_ThisWeek
source: This Week
ar_ly: هذا الأسبوع

# ReportsAndAnalytics_Period_ThisMonth
source: This Month
ar_ly: هذا الشهر

# ReportsAndAnalytics_Period_ThisQuarter
source: This Quarter
ar_ly: هذا الربع

# ReportsAndAnalytics_Period_ThisYear
source: This Year
ar_ly: هذه السنة

# ReportsAndAnalytics_Period_CustomRange
source: Custom Range
ar_ly: نطاق مخصص

# ReportsAndAnalytics_Summary_TotalRevenue
source: Total Revenue
ar_ly: إجمالي الإيرادات

# ReportsAndAnalytics_Summary_PaymentsReceived
source: {0} payments received
ar_ly: {0} مدفوعات مستلمة

# ReportsAndAnalytics_Summary_PendingPayments
source: Pending Payments
ar_ly: المدفوعات المعلقة

# ReportsAndAnalytics_Summary_PaymentsPending
source: {0} payments pending
ar_ly: {0} مدفوعات معلقة

# ReportsAndAnalytics_Summary_NewStudents
source: New Students
ar_ly: الطلاب الجدد

# ReportsAndAnalytics_Summary_InSelectedPeriod
source: in selected period
ar_ly: في الفترة المحددة

# ReportsAndAnalytics_Summary_Complaints
source: Complaints
ar_ly: الشكاوى

# ReportsAndAnalytics_Summary_ComplaintsResolved
source: {0} resolved
ar_ly: {0} تم حلها

# ReportsAndAnalytics_Chart_RevenueTrend
source: Revenue Trend
ar_ly: اتجاه الإيرادات

# ReportsAndAnalytics_Chart_PaymentStatus
source: Payment Status
ar_ly: حالة الدفع

# ReportsAndAnalytics_Chart_OccupancyByResidence
source: Occupancy by Residence
ar_ly: الإشغال حسب السكن

# ReportsAndAnalytics_Chart_Occupied
source: {0} / {1} occupied
ar_ly: {0} / {1} مشغول

# ReportsAndAnalytics_Chart_ComplaintsByCategory
source: Complaints by Category
ar_ly: الشكاوى حسب الفئة

# ReportsAndAnalytics_Table_TopRevenueGenerators
source: Top Revenue Generators
ar_ly: أعلى مولدات الإيرادات

# ReportsAndAnalytics_Table_Header_Residence
source: Residence
ar_ly: السكن

# ReportsAndAnalytics_Table_Header_Revenue
source: Revenue
ar_ly: الإيرادات

# ReportsAndAnalytics_Table_Header_Students
source: Students
ar_ly: الطلاب

# ReportsAndAnalytics_ActivitySummary
source: Activity Summary
ar_ly: ملخص النشاط

# ReportsAndAnalytics_Activity_UserLogins
source: {0} user logins
ar_ly: {0} تسجيلات دخول المستخدمين

# ReportsAndAnalytics_Activity_NewRegistrations
source: {0} new registrations
ar_ly: {0} تسجيلات جديدة

# ReportsAndAnalytics_Activity_PaymentsProcessed
source: {0} payments processed
ar_ly: {0} مدفوعات معالجة

# ReportsAndAnalytics_Activity_ComplaintsFiled
source: {0} complaints filed
ar_ly: {0} شكاوى مقدمة

# ReportsAndAnalytics_Activity_ComplaintsResolved
source: {0} complaints resolved
ar_ly: {0} شكاوى تم حلها

# RoomsManagement_PageTitle
source: Rooms Management
ar_ly: إدارة الغرف

# RoomsManagement_Header
source: Rooms Management
ar_ly: إدارة الغرف

# RoomsManagement_Subheader
source: Manage residence rooms and bed assignments
ar_ly: إدارة غرف السكن وتعيينات الأسرة

# RoomsManagement_Button_Add
source: Add New Room
ar_ly: إضافة غرفة جديدة

# RoomsManagement_Stats_Total
source: Total Rooms
ar_ly: إجمالي الغرف

# RoomsManagement_Stats_Available
source: Available Rooms
ar_ly: الغرف المتاحة

# RoomsManagement_Stats_TotalBeds
source: Total Beds
ar_ly: إجمالي الأسرة

# RoomsManagement_Stats_OccupancyRate
source: Occupancy Rate
ar_ly: معدل الإشغال

# RoomsManagement_SearchPlaceholder
source: Search rooms...
ar_ly: البحث عن غرف...

# RoomsManagement_View_Grid
source: Grid
ar_ly: شبكة

# RoomsManagement_View_List
source: List
ar_ly: قائمة

# RoomsManagement_Card_Room
source: Room {0}
ar_ly: غرفة {0}

# RoomsManagement_Card_Floor
source: Floor {0}
ar_ly: الطابق {0}

# RoomsManagement_Card_Status_Full
source: Full
ar_ly: ممتلئ

# RoomsManagement_Card_Status_Available
source: Available
ar_ly: متاح

# RoomsManagement_Card_BedsOccupied
source: {0}/{1} beds occupied
ar_ly: {0}/{1} سرير مشغول

# RoomsManagement_Card_ViewDetails
source: View Details
ar_ly: عرض التفاصيل

# RoomsManagement_Card_Edit
source: Edit
ar_ly: تعديل

# RoomsManagement_Card_Delete
source: Delete
ar_ly: حذف

# RoomsManagement_Table_Header_Room
source: Room
ar_ly: الغرفة

# RoomsManagement_Table_Header_Residence
source: Residence
ar_ly: السكن

# RoomsManagement_Table_Header_Type
source: Type
ar_ly: النوع

# RoomsManagement_Table_Header_Beds
source: Beds
ar_ly: الأسرة

# RoomsManagement_Table_Header_Occupancy
source: Occupancy
ar_ly: الإشغال

# RoomsManagement_Table_Header_Status
source: Status
ar_ly: الحالة

# RoomsManagement_Table_Header_Actions
source: Actions
ar_ly: الإجراءات

# RoomsManagement_Snackbar_CreateNotImplemented
source: Room creation functionality - coming soon!
ar_ly: وظيفة إنشاء الغرفة - قريباً!

# RoomsManagement_Snackbar_EditNotImplemented
source: Room editing functionality - coming soon!
ar_ly: وظيفة تعديل الغرفة - قريباً!

# RoomsManagement_Snackbar_Deleted
source: Room deleted successfully!
ar_ly: تم حذف الغرفة بنجاح!

# RoomsManagement_Dialog_ConfirmDelete_Title
source: Delete Room
ar_ly: حذف الغرفة

# RoomsManagement_Dialog_ConfirmDelete_Content
source: Are you sure you want to delete this room? Students assigned to this room will need to be reassigned!
ar_ly: هل أنت متأكد أنك تريد حذف هذه الغرفة؟ سيتعين إعادة تعيين الطلاب المعينين لهذه الغرفة!

# RoomsManagement_Dialog_ConfirmDelete_Button
source: Delete
ar_ly: حذف

# Dialog_Cancel
source: Cancel
ar_ly: إلغاء

# Dialog_OK
source: OK
ar_ly: موافق

# CreateRoleDialog_Title
source: Create New Role
ar_ly: إنشاء دور جديد

# CreateRoleDialog_Description
source: Create a new role for the system. This role can be assigned to users later.
ar_ly: إنشاء دور جديد للنظام. يمكن تعيين هذا الدور للمستخدمين لاحقًا.

# CreateRoleDialog_RoleName_Label
source: Role Name
ar_ly: اسم الدور

# CreateRoleDialog_RoleName_Placeholder
source: e.g., SecurityGuard
ar_ly: مثال: SecurityGuard

# CreateRoleDialog_RoleName_HelperText
source: Role name must be unique and contain no spaces
ar_ly: يجب أن يكون اسم الدور فريدًا ولا يحتوي على مسافات

# CreateRoleDialog_Description_Label
source: Description
ar_ly: الوصف

# CreateRoleDialog_Description_Placeholder
source: Describe the purpose and responsibilities of this role
ar_ly: وصف الغرض والمسؤوليات لهذا الدور

# CreateRoleDialog_Description_HelperText
source: Optional: Provide a brief description
ar_ly: اختياري: قدم وصفًا موجزًا

# CreateRoleDialog_Preview
source: Preview:
ar_ly: معاينة:

# CreateRoleDialog_Validation_NoSpaces
source: Role name cannot contain spaces
ar_ly: لا يمكن أن يحتوي اسم الدور على مسافات

# CreateRoleDialog_Validation_InvalidChars
source: Role name can only contain letters, numbers, and underscores
ar_ly: يمكن أن يحتوي اسم الدور على أحرف وأرقام وشرطات سفلية فقط

# CreateRoleDialog_Validation_MinLength
source: Role name must be at least 3 characters
ar_ly: يجب أن يكون اسم الدور 3 أحرف على الأقل

# CreateRoleDialog_Validation_MaxLength
source: Role name cannot exceed 50 characters
ar_ly: يجب ألا يتجاوز اسم الدور 50 حرفًا

# CreateRoleDialog_Validation_Valid
source: ✓ Valid role name
ar_ly: ✓ اسم دور صالح

# CreateRoleDialog_Button_Cancel
source: Cancel
ar_ly: إلغاء

# CreateRoleDialog_Button_Create
source: Create Role
ar_ly: إنشاء دور

# CreateRoleDialog_Snackbar_Exists
source: Role '{0}' already exists!
ar_ly: الدور '{0}' موجود بالفعل!
