Repository: alhabib3031/StudentResidenceManagementSystemSRMS
Catalog: SRMS.WebUI.Server/Resources/Resource.*.resx
Languages: ar_ly

# AuditLogDetailsDialog_Username
source: Username
ar_ly: اسم المستخدم

# ComplaintDetails_Button_BackToList
source: Back to List
ar_ly: العودة إلى القائمة

# ComplaintDetails_Error_NotFound
source: Complaint not found or you do not have permission to view it.
ar_ly: لم يتم العثور على الشكوى أو ليس لديك الإذن لعرضها.

# ComplaintDetails_Header_Category
source: Category
ar_ly: الفئة / التصنيف

# ComplaintDetails_Header_CreatedOn
source: Created On
ar_ly: تاريخ الإنشاء / أُنشِئ في

# ComplaintDetails_Header_Description
source: Description
ar_ly: الوصف

# ComplaintDetails_Header_Priority
source: Priority
ar_ly: الأولوية

# ComplaintDetails_Header_Resolution
source: Resolution
ar_ly: الحل / القرار

# ComplaintDetails_Header_Student
source: Student
ar_ly: الطالب

# ComplaintDetails_ManagerNotes
source: Manager's Notes:
ar_ly: ملاحظات المدير:

# ComplaintDetails_PageTitle
source: Complaint Details
ar_ly: تفاصيل الشكوى

# ComplaintDetails_ResolvedOn
source: Resolved on: {0}
ar_ly: تم الحل في: {0}

# ComplaintsManagement_Actions_AssignToMe
source: Assign to Me
ar_ly: تعيين لي / إسناد لي

# ComplaintsManagement_Actions_MarkAsResolved
source: Mark as Resolved
ar_ly: وضع علامة "تم الحل"

# ComplaintsManagement_Actions_ViewDetails
source: View Details
ar_ly: عرض التفاصيل

# ComplaintsManagement_Button_Refresh
source: Refresh
ar_ly: تحديث

# ComplaintsManagement_Filter_Category
source: Category
ar_ly: الفئة / التصنيف

# ComplaintsManagement_Filter_Priority
source: Priority
ar_ly: الأولوية

# ComplaintsManagement_Filter_Status
source: Status
ar_ly: الحالة

# ComplaintsManagement_Header
source: Complaints Management
ar_ly: إدارة الشكاوى

# ComplaintsManagement_NoComplaints_Header
source: No Complaints
ar_ly: لا توجد شكاوى

# ComplaintsManagement_NoComplaints_Subheader
source: Try adjusting your filters
ar_ly: حاول تعديل عوامل التصفية لديك

# ComplaintsManagement_PageTitle
source: Complaints Management
ar_ly: إدارة الشكاوى

# ComplaintsManagement_SearchPlaceholder
source: Search
ar_ly: بحث

# ComplaintsManagement_Snackbar_Assigned
source: Complaint assigned to you!
ar_ly: تم تعيين الشكوى لك!

# ComplaintsManagement_Snackbar_Resolved
source: Complaint marked as resolved!
ar_ly: تم وضع علامة "تم الحل" على الشكوى

# ComplaintsManagement_Stats_InProgress
source: In Progress
ar_ly: قيد التقدم

# ComplaintsManagement_Stats_Open
source: Open
ar_ly: مفتوحة

# ComplaintsManagement_Stats_Resolved
source: Resolved
ar_ly: محلولة / تم حلها

# ComplaintsManagement_Stats_Total
source: Total
ar_ly: الإجمالي

# ComplaintsManagement_Subheader
source: Track and resolve student complaints
ar_ly: تتبُّع وحل شكاوى الطلاب

# ComplaintsManagement_Table_Header_Actions
source: Actions
ar_ly: الإجراءات

# ComplaintsManagement_Table_Header_Category
source: Category
ar_ly: التصنيف

# ComplaintsManagement_Table_Header_Created
source: Created
ar_ly: تاريخ الإنشاء / أُنشِئ

# ComplaintsManagement_Table_Header_ID
source: ID
ar_ly: مُعرِّف / هوية

# ComplaintsManagement_Table_Header_Priority
source: Priority
ar_ly: الأولوية

# ComplaintsManagement_Table_Header_Status
source: Status
ar_ly: الحالة

# ComplaintsManagement_Table_Header_Student
source: Student
ar_ly: الطالب

# ComplaintsManagement_Table_Header_Title
source: Title
ar_ly: العنوان

# ConfirmWithTextDialog_Button_Cancel
source: Cancel
ar_ly: إلغاء

# ConfirmWithTextDialog_HelperText
source: Type '{0}' exactly to confirm
ar_ly: اكتب '{0}' بالضبط للتأكيد

# ConfirmWithTextDialog_Label
source: Type confirmation text
ar_ly: اكتب نص التأكيد

# ConfirmWithTextDialog_Title
source: Confirmation Required
ar_ly: التأكيد مطلوب

# ConfirmWithTextDialog_Validation_Match
source: ✓ Confirmation text is correct
ar_ly: ✓ نص التأكيد صحيح

# ConfirmWithTextDialog_Validation_Mismatch
source: ❌ Text does not match. Please type exactly: <strong>{0}</strong>
ar_ly: ❌ النص غير مطابق. الرجاء الكتابة بالحرف الواحد: {0}

# CreateComplaintDialog_Button_Cancel
source: Cancel
ar_ly: إلغاء

# CreateComplaintDialog_Button_Submit
source: Submit Complaint
ar_ly: تقديم شكوى

# CreateComplaintDialog_Category_Cleanliness
source: 🧹 Cleanliness
ar_ly: 🪣 النظافة

# CreateComplaintDialog_Category_Facilities
source: 🏢 Facilities
ar_ly: 🏗️ المرافق / التسهيلات

# CreateComplaintDialog_Category_Internet
source: 📶 Internet
ar_ly: 📶 الإنترنت

# CreateComplaintDialog_Category_Maintenance
source: 🔧 Maintenance
ar_ly: 🛠️ الصيانة

# CreateComplaintDialog_Category_Management
source: 📋 Management
ar_ly: 👨‍💼 الإدارة

# CreateComplaintDialog_Category_Noise
source: 🔊 Noise
ar_ly: 🔊 الضوضاء / الإزعاج

# CreateComplaintDialog_Category_Other
source: 📝 Other
ar_ly: ⚙️ أخرى

# CreateComplaintDialog_Category_RoommateIssue
source: 👥 Roommate Issue
ar_ly: 📢 مشكلة زميل السكن

# CreateComplaintDialog_Category_Security
source: 🔒 Security
ar_ly: 🔒 الأمان / الأمن

# CreateComplaintDialog_Category_Utilities
source: 💡 Utilities
ar_ly: 💡 الخدمات / المرافق العامة

# CreateComplaintDialog_Error_DescriptionRequired
source: Description is required
ar_ly: الوصف مطلوب

# CreateComplaintDialog_Error_TitleRequired
source: Title is required
ar_ly: العنوان مطلوب

# CreateComplaintDialog_Helper_Description
source: Describe your complaint in detail
ar_ly: صِف شكواك بالتفصيل

# CreateComplaintDialog_Label_Category
source: Category
ar_ly: الفئة / التصنيف

# CreateComplaintDialog_Label_Description
source: Description
ar_ly: الوصف

# CreateComplaintDialog_Label_Priority
source: Priority
ar_ly: الأولوية

# CreateComplaintDialog_Label_Title
source: Title
ar_ly: العنوان

# CreateComplaintDialog_Priority_Critical
source: Critical - Requires immediate action
ar_ly: حرج - يتطلب إجراءً فورياً

# CreateComplaintDialog_Priority_High
source: High - Needs attention soon
ar_ly: عالٍ - يحتاج إلى الاهتمام قريباً

# CreateComplaintDialog_Priority_Low
source: Low - Not urgent
ar_ly: منخفض - ليس عاجلاً

# CreateComplaintDialog_Priority_Medium
source: Medium - Normal priority
ar_ly: متوسط - أولوية عادية

# CreateComplaintDialog_Title
source: New Complaint
ar_ly: شكوى جديدة

# CreateNotificationDialog_Audience_Admins
source: Admins
ar_ly: المسؤولون

# CreateNotificationDialog_Audience_All
source: All Users
ar_ly: جميع المستخدمين

# CreateNotificationDialog_Audience_Managers
source: Managers
ar_ly: المديرون

# CreateNotificationDialog_Audience_Students
source: Students
ar_ly: الطلاب

# CreateNotificationDialog_Button_Cancel
source: Cancel
ar_ly: إلغاء

# CreateNotificationDialog_Button_Send
source: Send
ar_ly: إرسال

# CreateNotificationDialog_Label_Message
source: Message
ar_ly: رسالة

# CreateNotificationDialog_Label_Priority
source: Priority
ar_ly: الأولوية

# CreateNotificationDialog_Label_TargetAudience
source: Target Audience
ar_ly: الجمهور المستهدف

# CreateNotificationDialog_Label_Title
source: Title
ar_ly: العنوان

# CreateNotificationDialog_Label_Type
source: Type
ar_ly: النوع

# CreateNotificationDialog_Priority_High
source: High
ar_ly: عالٍ

# CreateNotificationDialog_Priority_Low
source: Low
ar_ly: منخفض

# CreateNotificationDialog_Priority_Normal
source: Normal
ar_ly: عادي

# CreateNotificationDialog_Priority_Urgent
source: Urgent
ar_ly: عاجل

# CreateNotificationDialog_Title
source: Create Notification
ar_ly: إنشاء إشعار

# CreateNotificationDialog_Type_Announcement
source: Announcement
ar_ly: إعلان

# CreateNotificationDialog_Type_Info
source: Info
ar_ly: معلومات

# CreateNotificationDialog_Type_System
source: System
ar_ly: النظام

# CreateNotificationDialog_Type_Warning
source: Warning
ar_ly: تحذير

# CreateResidenceDialog_Address
source: Address
ar_ly: العنوان

# CreateResidenceDialog_Button_Cancel
source: Cancel
ar_ly: إلغاء

# CreateResidenceDialog_Button_Create
source: Create
ar_ly: إنشاء

# CreateResidenceDialog_City
source: City
ar_ly: المدينة

# CreateResidenceDialog_Country
source: Country
ar_ly: الدولة

# CreateResidenceDialog_Description
source: Description
ar_ly: الوصف

# CreateResidenceDialog_Facilities
source: Facilities
ar_ly: المرافق

# CreateResidenceDialog_Facility_Gym
source: Gym
ar_ly: صالة الألعاب الرياضية / الجيم

# CreateResidenceDialog_Facility_Kitchen
source: Kitchen
ar_ly: المطبخ

# CreateResidenceDialog_Facility_Laundry
source: Laundry
ar_ly: المغسلة / غرفة الغسيل

# CreateResidenceDialog_Facility_Parking
source: Parking
ar_ly: موقف السيارات

# CreateResidenceDialog_Facility_Pool
source: Pool
ar_ly: المسبح

# CreateResidenceDialog_Facility_Security
source: Security
ar_ly: الأمان / الأمن

# CreateResidenceDialog_Facility_StudyRoom
source: Study Room
ar_ly: غرفة الدراسة

# CreateResidenceDialog_Facility_WiFi
source: WiFi
ar_ly: الواي فاي / الإنترنت اللاسلكي

# CreateResidenceDialog_MonthlyRent
source: Monthly Rent
ar_ly: الإيجار الشهري

# CreateResidenceDialog_Name
source: Residence Name
ar_ly: اسم السكن / الإقامة

# CreateResidenceDialog_Name_Required
source: Name is required
ar_ly: الاسم مطلوب

# CreateResidenceDialog_Snackbar_Error
source: Error creating residence: {0}
ar_ly: خطأ في إنشاء الإقامة

# CreateResidenceDialog_State
source: State
ar_ly: الولاية / المقاطعة

# CreateResidenceDialog_Street
source: Street
ar_ly: الشارع

# CreateResidenceDialog_Title
source: Add New Residence
ar_ly: إضافة سكن جديد

# CreateResidenceDialog_TotalCapacity
source: Total Capacity
ar_ly: السعة الإجمالية

# CreateResidenceDialog_ZipCode
source: Zip Code
ar_ly: الرمز البريدي

# ManagerDashboard_Active
source: Active
ar_ly: نشط

# ManagerDashboard_AddNewStudent
source: Add New Student
ar_ly: إضافة طالب جديد

# ManagerDashboard_AssignNewStudent
source: Assign new student to room
ar_ly: تخصيص غرفة لطالب جديد

# ManagerDashboard_AvailableRooms
source: Available Rooms
ar_ly: الغرف المتاحة

# ManagerDashboard_BuildingInspection
source: Building inspection
ar_ly: تفتيش المبنى

# ManagerDashboard_DueIn
source: Due in 2 hours
ar_ly: مستحق خلال ساعتين

# ManagerDashboard_DuePayments
source: Due Payments
ar_ly: المدفوعات المستحقة

# ManagerDashboard_DueTomorrow
source: Due tomorrow
ar_ly: مستحق غدًا

# ManagerDashboard_FollowUpPayments
source: Follow up on overdue payments
ar_ly: متابعة المدفوعات المتأخرة

# ManagerDashboard_GenerateReport
source: Generate Report
ar_ly: إنشاء تقرير

# ManagerDashboard_Header
source: Manager Dashboard
ar_ly: لوحة تحكم المدير

# ManagerDashboard_ManageRooms
source: Manage Rooms
ar_ly: إدارة الغرف

# ManagerDashboard_MonthlyReport
source: Submit monthly report
ar_ly: تقديم التقرير الشهري

# ManagerDashboard_MyStudents
source: My Students
ar_ly: طلابي

# ManagerDashboard_NeedsAttention
source: needs attention
ar_ly: يحتاج إلى اهتمام/متابعة

# ManagerDashboard_NewStudentsThisWeek
source: New Students This Week
ar_ly: الطلاب الجدد هذا الأسبوع

# ManagerDashboard_Overdue
source: overdue
ar_ly: متأخر/فات موعده

# ManagerDashboard_PageTitle
source: Manager Dashboard
ar_ly: لوحة تحكم المدير

# ManagerDashboard_Pending
source: Pending
ar_ly: معلق

# ManagerDashboard_PendingComplaints
source: Pending Complaints
ar_ly: شكاوى معلقة

# ManagerDashboard_QuickActions
source: Quick Actions
ar_ly: إجراءات سريعة

# ManagerDashboard_ReadyToAssign
source: ready to assign
ar_ly: جاهز للتخصيص

# ManagerDashboard_RecordPayment
source: Record Payment
ar_ly: تسجيل الدفعة

# ManagerDashboard_ReviewComplaint
source: Review Room 201 complaint
ar_ly: مراجعة شكوى الغرفة 201

# ManagerDashboard_Room
source: Room
ar_ly: غرفة

# ManagerDashboard_Students
source: students
ar_ly: طلاب

# ManagerDashboard_StudentsThisWeek
source: +3 this week
ar_ly: +3 هذا الأسبوع

# ManagerDashboard_TasksToday
source: Today's Tasks
ar_ly: مهام اليوم

# ManagerDashboard_Tomorrow
source: Tomorrow 10am
ar_ly: غداً 10 صباحاً

# ManagerDashboard_Urgent
source: Urgent
ar_ly: عاجل

# ManagerDashboard_ViewComplaints
source: View Complaints
ar_ly: عرض الشكاوى

# ManagerDashboard_Welcome
source: Welcome back, {0}
ar_ly: أهلاً بعودتك، {0}

# PaymentsManagement_Actions_Edit
source: Edit
ar_ly: تعديل

# PaymentsManagement_Actions_GenerateReceipt
source: Generate Receipt
ar_ly: إنشاء إيصال/سند قبض

# PaymentsManagement_Actions_MarkAsPaid
source: Mark as Paid
ar_ly: وضع علامة "مدفوع"

# PaymentsManagement_Actions_ViewDetails
source: View Details
ar_ly: عرض التفاصيل

# PaymentsManagement_Button_RecordPayment
source: Record Payment
ar_ly: تسجيل دفعة

# PaymentsManagement_Filter_Month
source: Month
ar_ly: الشهر

# PaymentsManagement_Filter_Status
source: Status
ar_ly: الحالة

# PaymentsManagement_Filter_Year
source: Year
ar_ly: السنة/العام

# PaymentsManagement_Header
source: Payments Management
ar_ly: إدارة الدفعات/المدفوعات

# PaymentsManagement_PageTitle
source: Payments Management
ar_ly: إدارة الدفعات/المدفوعات

# PaymentsManagement_SearchPlaceholder
source: Search
ar_ly: بحث

# PaymentsManagement_Snackbar_ConfirmPayment
source: Confirm Payment
ar_ly: وظيفة تعديل الدفعة - قريباً!

# PaymentsManagement_Snackbar_EditPaymentComingSoon
source: Edit payment functionality - coming soon!
ar_ly: جاري إنشاء الإيصال...

# PaymentsManagement_Snackbar_GeneratingReceipt
source: Generating receipt...
ar_ly: هل تريد وضع علامة على هذه الدفعة كمدفوعة؟

# PaymentsManagement_Snackbar_MarkAsPaidConfirm
source: Mark this payment as paid?
ar_ly: تم وضع علامة على الدفعة كمدفوعة!

# PaymentsManagement_Snackbar_PaymentMarkedAsPaid
source: Payment marked as paid!
ar_ly: وظيفة تسجيل الدفعة - قريباً!

# PaymentsManagement_Snackbar_RecordPaymentComingSoon
source: Record payment functionality - coming soon!
ar_ly: متأخر/فات موعده

# PaymentsManagement_Stats_Overdue
source: Overdue
ar_ly: مدفوع

# PaymentsManagement_Stats_Paid
source: Paid
ar_ly: معلق

# PaymentsManagement_Stats_Pending
source: Pending
ar_ly: إجمالي الإيرادات

# PaymentsManagement_Stats_TotalRevenue
source: Total Revenue
ar_ly: تتبع وإدارة دفعات الطلاب

# PaymentsManagement_Subheader
source: Track and manage student payments
ar_ly: تتبع وإدارة دفعات الطلاب

# PaymentsManagement_Table_Header_Actions
source: Actions
ar_ly: إجراءات

# PaymentsManagement_Table_Header_Amount
source: Amount
ar_ly: المبلغ

# PaymentsManagement_Table_Header_Description
source: Description
ar_ly: الوصف

# PaymentsManagement_Table_Header_DueDate
source: Due Date
ar_ly: تاريخ الاستحقاق

# PaymentsManagement_Table_Header_PaidDate
source: Paid Date
ar_ly: تاريخ الدفع

# PaymentsManagement_Table_Header_PaymentID
source: Payment ID
ar_ly: رقم تعريف الدفعة

# PaymentsManagement_Table_Header_Period
source: Period
ar_ly: الفترة

# PaymentsManagement_Table_Header_Status
source: Status
ar_ly: الحالة

# PaymentsManagement_Table_Header_Student
source: Student
ar_ly: الطالب

# PaymentsManagement_Table_ID
source: ID:
ar_ly: رقم التعريف/الهوية

# PaymentsManagement_Table_NA
source: N/A
ar_ly: غير متوفر / لا ينطبق

# ResolveComplaintDialog_Button_Cancel
source: Cancel
ar_ly: إلغاء

# ResolveComplaintDialog_Button_MarkAsResolved
source: Mark as Resolved
ar_ly: وضع علامة "تم الحل"

# ResolveComplaintDialog_Description
source: Please provide details on how this complaint was resolved.
ar_ly: يرجى تقديم تفاصيل حول كيفية حل

# ResolveComplaintDialog_Error_ResolutionNotesRequired
source: Please provide resolution notes
ar_ly: يرجى تقديم ملاحظات الحل/البت

# ResolveComplaintDialog_Label_ResolutionNotes
source: Resolution Notes
ar_ly: ملاحظات الحل

# ResolveComplaintDialog_Placeholder_ResolutionNotes
source: Enter resolution details...
ar_ly: أدخل تفاصيل الحل...

# ResolveComplaintDialog_Title
source: Resolve Complaint
ar_ly: حل الشكوى

# AccountType_PageTitle
source: Select Account Type
ar_ly: اختيار نوع الحساب

# AccountType_Selection
source: Choose Your Account Type
ar_ly: اختر نوع حسابك

# AccountType_SelectMessage
source: Please select the type of account you want to create. This will determine your permissions and available features in the system.
ar_ly: يرجى تحديد نوع الحساب الذي تريد إنشاؤه. سيحدد هذا صلاحياتك والميزات المتاحة لك في النظام.

# AccountType_Student
source: Student
ar_ly: طالب

# AccountType_Student_Description
source: Apply for housing, manage your room, pay fees and submit maintenance requests.
ar_ly: قدم طلب سكن، أدر غرفتك، ادفع الرسوم وقدم طلبات الصيانة.

# AccountType_ChooseStudent
source: Choose as Student
ar_ly: اختر كطالب

# AccountType_CollegeRegistrar
source: College Registrar
ar_ly: مسجل الكلية

# AccountType_Registrar_Description
source: Manage student enrollments, verify documents and coordinate with housing administration.
ar_ly: أدر تسجيلات الطلاب، تحقق من المستندات ونسق مع إدارة السكن.

# AccountType_ChooseRegistrar
source: Choose as Registrar
ar_ly: اختر كمسجل

# ProfileCompletion_Student_Title
source: Student Profile Completion
ar_ly: إكمال ملف الطالب

# ProfileCompletion_Registrar_Title
source: College Registrar Profile Completion
ar_ly: إكمال ملف مسجل الكلية

# ProfileCompletion_Step_Personal
source: Personal Information
ar_ly: المعلومات الشخصية

# ProfileCompletion_Step_Academic
source: Academic Details
ar_ly: التفاصيل الأكاديمية

# ProfileCompletion_Step_Address
source: Address & Emergency
ar_ly: العنوان والطوارئ

# ProfileCompletion_Step_Documents
source: Upload Documents
ar_ly: رفع المستندات

# ProfileCompletion_NationalId
source: National ID / Passport
ar_ly: الرقم الوطني / جواز السفر

# ProfileCompletion_Nationality
source: Nationality
ar_ly: الجنسية

# ProfileCompletion_DOB
source: Date of Birth
ar_ly: تاريخ الميلاد

# ProfileCompletion_Gender
source: Gender
ar_ly: الجنس

# ProfileCompletion_University
source: University Name
ar_ly: اسم الجامعة

# ProfileCompletion_StudentNumber
source: Student Number
ar_ly: الرقم الدراسي

# ProfileCompletion_Major
source: Major / Department
ar_ly: التخصص / القسم

# ProfileCompletion_College
source: College
ar_ly: الكلية

# ProfileCompletion_AcademicYear
source: Academic Year
ar_ly: السنة الدراسية

# ProfileCompletion_AcademicTerm
source: Academic Term
ar_ly: الفصل الدراسي

# ProfileCompletion_EmergencyName
source: Emergency Contact Name
ar_ly: اسم جهة الاتصال في حالات الطوارئ

# ProfileCompletion_EmergencyPhone
source: Emergency Phone
ar_ly: هاتف الطوارئ

# ProfileCompletion_EmergencyRelation
source: Relationship
ar_ly: صلة القرابة

# ProfileCompletion_Doc_Birth
source: Birth Certificate
ar_ly: شهادة الميلاد

# ProfileCompletion_Doc_HighSchool
source: High School Certificate
ar_ly: الشهادة الثانوية

# ProfileCompletion_Doc_Health
source: Health Certificate
ar_ly: الشهادة الصحية

# ProfileCompletion_Doc_Residence
source: Residence Permit (for non-Libyans)
ar_ly: تصريح الإقامة (لغير الليبيين)

# ProfileCompletion_Submit
source: Submit for Review
ar_ly: إرسال للمراجعة

# ProfileCompletion_Success
source: Profile submitted successfully! Please wait for admin approval.
ar_ly: تم إرسال الملف بنجاح! يرجى انتظار موافقة المسؤول.

# ProfileCompletion_Error
source: An error occurred while submitting the profile. Please check your data.
ar_ly: حدث خطأ أثناء إرسال الملف. يرجى التحقق من بياناتك.

# ProfileCompletion_EmployeeNumber
source: Employee Number
ar_ly: الرقم الوظيفي

# Profile_Status_PendingApproval
source: Pending Approval
ar_ly: قيد المراجعة

# Profile_Status_Rejected
source: Profile Rejected
ar_ly: تم رفض الملف

# Profile_RejectionReason
source: Rejection Reason:
ar_ly: سبب الرفض:

# Profile_Status_Message_Pending
source: Your profile is currently under review by the administration. You will be notified once it is approved.
ar_ly: ملفك الشخصي حالياً قيد المراجعة من قبل الإدارة. سيتم إخطارك بمجرد الموافقة عليه.

# Profile_Status_Message_Rejected
source: Unfortunately, your profile request was rejected. Please review the reason below and update your profile.
ar_ly: للأسف، تم رفض طلب ملفك الشخصي. يرجى مراجعة السبب أدناه وتحديث ملفك.

# Profile_Button_UpdateProfile
source: Update Profile
ar_ly: تحديث الملف الشخصي

# Admin_UserReviews_Title
source: Account Review Requests
ar_ly: طلبات مراجعة الحسابات

# Admin_UserReviews_NoPending
source: No pending requests at the moment.
ar_ly: لا توجد طلبات معلقة حالياً.

# User_FullName
source: Full Name
ar_ly: الاسم الكامل

# User_RegistrationDate
source: Registration Date
ar_ly: تاريخ التسجيل

# User_AccountType
source: Requested Type
ar_ly: النوع المطلوب

source: Actions
ar_ly: الإجراءات

source: View Details
ar_ly: عرض التفاصيل

source: Approve
ar_ly: موافقة

source: Reject
ar_ly: رفض

# RejectionReason_Required
source: Please provide a reason for rejection.
ar_ly: يرجى ذكر سبب الرفض.

# ConfirmApprove
source: Are you sure you want to approve this profile?
ar_ly: هل أنت متأكد من الموافقة على هذا الملف؟

# ReviewDetails_Title
source: Review User Profile
ar_ly: مراجعة ملف المستخدم

source: Documents
ar_ly: المستندات

source: Back
ar_ly: رجوع

source: Cancel
ar_ly: إلغاء

source: Loading
ar_ly: جاري التحميل

source: Refresh
ar_ly: تحديث

source: Logout
ar_ly: تسجيل الخروج

source: Unknown
ar_ly: غير معروف

# Registrar_Dashboard_Title
source: College Registrar Dashboard
ar_ly: لوحة تحكم مسجل الكلية

# Registrar_MyCollege
source: My College
ar_ly: كليتي

# Registrar_TotalStudents
source: Total Students
ar_ly: إجمالي الطلاب

# Registrar_PendingVerification_Title
source: Students Pending Academic Verification
ar_ly: طلاب بانتظار التحقق الأكاديمي

# Student_AcademicStatus
source: Academic Status
ar_ly: الحالة الأكاديمية

source: Verify
ar_ly: تحقق

source: Verified
ar_ly: تم التحقق

# Common_Create
source: Create Student
ar_ly: إنشاء

# Common_Cancel
source: Cancel
ar_ly: إلغاء

# Common_Close
source: Close
ar_ly: إغلاق

# Common_Save
source: Save
ar_ly: حفظ

# Common_Edit
source: Edit
ar_ly: تعديل

# Common_Delete
source: Delete
ar_ly: حذف

# Common_ViewDetails
source: View Details
ar_ly: عرض التفاصيل

# Common_Loading
source: Loading...
ar_ly: جاري التحميل...

# Common_Yes
source: Yes
ar_ly: نعم

# Common_No
source: No
ar_ly: لا

# Common_AuditInfo
source: Audit Info
ar_ly: معلومات التدقيق

# Common_Created
source: Created at
ar_ly: تم الإنشاء في

# Common_by
source: by
ar_ly: بواسطة

# Common_LastModified
source: Last modified at
ar_ly: آخر تعديل في

# Common_Error_Unexpected
source: An unexpected error occurred.
ar_ly: حدث خطأ غير متوقع.

# Common_Error_Exception
source: Error: {0}
ar_ly: خطأ: {0}

# Common_ConfirmDeletion
source: Confirm Deletion
ar_ly: تأكيد الحذف

# Common_Actions
source: Actions
ar_ly: الإجراءات

# RoomManagement_PageTitle
source: Room Management
ar_ly: إدارة الغرف

# RoomManagement_Header
source: Room Management
ar_ly: إدارة الغرف

# RoomManagement_Button_Add
source: Add Room
ar_ly: إضافة غرفة

# RoomManagement_SearchPlaceholder
source: Search for a room...
ar_ly: بحث عن غرفة...

# RoomManagement_Filter_RoomType
source: Room Type
ar_ly: نوع الغرفة

# RoomManagement_Filter_RoomStatus
source: Room Status
ar_ly: حالة الغرفة

# RoomManagement_Snackbar_Created
source: Room created successfully.
ar_ly: تم إنشاء الغرفة بنجاح.

# RoomManagement_Snackbar_Updated
source: Room updated successfully.
ar_ly: تم تحديث الغرفة بنجاح.

# RoomManagement_Snackbar_Deleted
source: Room {0} deleted successfully.
ar_ly: تم حذف الغرفة {0} بنجاح.

# RoomManagement_Dialog_ConfirmDelete_Content
source: Are you sure you want to delete room {0}?
ar_ly: هل أنت متأكد أنك تريد حذف الغرفة {0}؟

# Room_RoomNumber
source: Room Number
ar_ly: رقم الغرفة

# Room_RoomNumber_Required
source: Room number is required.
ar_ly: رقم الغرفة مطلوب.

# Room_Floor
source: Floor
ar_ly: الطابق

# Room_Floor_Required
source: Floor is required.
ar_ly: الطابق مطلوب.

# Room_TotalBeds
source: Total Beds
ar_ly: عدد الأسرة

# Room_TotalBeds_Required
source: Total beds is required.
ar_ly: عدد الأسرة مطلوب.

# Room_OccupiedBeds
source: Occupied Beds
ar_ly: الأسرة المشغولة

# Room_RoomType
source: Room Type
ar_ly: نوع الغرفة

# Room_RoomType_Required
source: Room type is required.
ar_ly: نوع الغرفة مطلوب.

# Room_MonthlyRentAmount
source: Monthly Rent
ar_ly: الإيجار الشهري

# Room_MonthlyRentAmount_Required
source: Monthly rent is required.
ar_ly: الإيجار الشهري مطلوب.

# Room_MonthlyRentCurrency
source: Currency
ar_ly: العملة

# Room_MonthlyRentCurrency_Required
source: Currency is required.
ar_ly: العملة مطلوبة.

# Room_Status
source: Status
ar_ly: الحالة
