Repository: alhabib3031/StudentResidenceManagementSystemSRMS
Catalog: SRMS.WebUI.Server/Resources/Resource.*.resx
Languages: ar_ly

# Reservation_Error_Unknown
source: An unknown error occurred during reservation.
ar_ly: حدث خطأ غير معروف أثناء الحجز.

# Reservation_Error_Unexpected
source: An unexpected error occurred: {0}
ar_ly: حدث خطأ غير متوقع: {0}

# VacantRooms_Title
source: Available Rooms
ar_ly: الغرف المتاحة

# VacantRooms_Loading
source: Loading available rooms...
ar_ly: جاري تحميل الغرف المتاحة...

# VacantRooms_NoRooms
source: No vacant rooms currently available in this residence.
ar_ly: لا توجد غرف شاغرة حاليًا في هذا السكن.

# VacantRooms_Room
source: Room
ar_ly: غرفة

# VacantRooms_Floor
source: Floor
ar_ly: الطابق

# VacantRooms_Type
source: Type
ar_ly: النوع

# VacantRooms_Beds
source: Beds
ar_ly: الأسرّة

# VacantRooms_Monthly
source: Monthly
ar_ly: شهرياً

# VacantRooms_Select
source: Select for Reservation
ar_ly: اختر للحجز

# CreateStudent_PageTitle
source: Create Student
ar_ly: إنشاء طالب

# CreateStudent_Header
source: Create New Student
ar_ly: إنشاء طالب جديد

# CreateStudent_FirstName
source: First Name
ar_ly: الاسم الأول

# CreateStudent_LastName
source: Last Name
ar_ly: اسم العائلة

# CreateStudent_Email
source: Email
ar_ly: البريد الإلكتروني

# CreateStudent_Phone
source: Phone Number
ar_ly: رقم الهاتف

# Common_Creating
source: Creating...
ar_ly: جاري الإنشاء...

# CreateStudent_Error
source: Error creating student: {0}
ar_ly: خطأ في إنشاء الطالب: {0}

# Help_PopularTopic_GettingStarted_Title
source: Getting Started
ar_ly: البداية

# Help_PopularTopic_GettingStarted_Desc
source: Learn the basics of using SRMS
ar_ly: تعلم أساسيات استخدام SRMS

# Help_PopularTopic_RoomManagement_Title
source: Room Management
ar_ly: إدارة الغرف

# Help_PopularTopic_RoomManagement_Desc
source: Everything about rooms and bookings
ar_ly: كل شيء عن الغرف والحجوزات

# Help_PopularTopic_Payments_Title
source: Payments & Billing
ar_ly: المدفوعات والفوترة

# Help_PopularTopic_Payments_Desc
source: Payment methods and billing info
ar_ly: طرق الدفع ومعلومات الفوترة

# Help_PopularTopic_Account_Title
source: Account Settings
ar_ly: إعدادات الحساب

# Help_PopularTopic_Account_Desc
source: Manage your account preferences
ar_ly: إدارة تفضيلات حسابك

# Help_PopularTopic_Complaints_Title
source: Complaints & Support
ar_ly: الشكاوي والدعم

# Help_PopularTopic_Complaints_Desc
source: How to get help when you need it
ar_ly: كيفية الحصول على المساعدة عند الحاجة

# Help_PopularTopic_Security_Title
source: Security & Privacy
ar_ly: الأمان والخصوصية

# Help_PopularTopic_Security_Desc
source: Keep your account safe and secure
ar_ly: حافظ على أمان وسلامة حسابك
