Repository: alhabib3031/StudentResidenceManagementSystemSRMS
Catalog: SRMS.WebUI.Server/Resources/Resource.*.resx
Languages: ar_ly

# Room_IsAvailable
source: Available
ar_ly: متاح

# Room_Residence
source: Residence
ar_ly: السكن

# Room_Amenities
source: Amenities
ar_ly: وسائل الراحة

# Room_MonthlyRent
source: Monthly Rent
ar_ly: الإيجار الشهري

# Amenity_Bathroom
source: Private Bathroom
ar_ly: حمام خاص

# Amenity_AC
source: Air Conditioning
ar_ly: تكييف

# Amenity_Heating
source: Heating
ar_ly: تدفئة

# Amenity_WiFi
source: WiFi
ar_ly: واي فاي

# Amenity_Desk
source: Desk
ar_ly: مكتب

# Amenity_Wardrobe
source: Wardrobe
ar_ly: خزانة ملابس

# Amenity_Balcony
source: Balcony
ar_ly: شرفة

# Currency_USD
source: USD
ar_ly: دولار أمريكي

# Currency_LYD
source: LYD
ar_ly: دينار ليبي

source: Single
ar_ly: فردية

source: Double
ar_ly: مزدوجة

source: Shared
ar_ly: مشتركة

source: Suite
ar_ly: جناح

source: Apartment
ar_ly: شقة

source: Available
ar_ly: متاح

source: Occupied
ar_ly: مشغول

source: Maintenance
ar_ly: صيانة

# CreateRoomDialog_Title
source: Add New Room
ar_ly: إضافة غرفة جديدة

# EditRoomDialog_Title
source: Edit Room
ar_ly: تعديل الغرفة

# RoomDetailsDialog_Title
source: Room Details
ar_ly: تفاصيل الغرفة

# EditRoomDialog_Success
source: Room updated successfully.
ar_ly: تم تحديث الغرفة بنجاح.

# Stats_Header
source: Status
ar_ly: الحالة

source: Database Reset Successfully
ar_ly: تمت إعادة ضبط قاعدة البيانات بنجاح

source: Failed To Reset Database
ar_ly: فشل إعادة ضبط قاعدة البيانات

# DangerZone_Title
source: Danger Zone
ar_ly: منطقة الخطر

# DangerZone_Header
source: Danger Zone
ar_ly: منطقة الخطر

# DangerZone_SubHeader
source: Advanced administrative actions. Please proceed with caution.
ar_ly: إجراءات إدارية متقدمة. يرجى المتابعة بحذر.

# DangerZone_CriticalWarning
source: CRITICAL WARNING:
ar_ly: تحذير حرج:

# DangerZone_CriticalWarningMessage
source: These actions can cause irreversible data loss. Please be absolutely certain before proceeding.
ar_ly: يمكن أن تتسبب هذه الإجراءات في فقدان البيانات بشكل لا رجعة فيه. يرجى التأكد تمامًا قبل المتابعة.

source: Clear All Cache
ar_ly: مسح كل الذاكرة المؤقتة

source: Moderate Risk
ar_ly: خطر متوسط

# ClearAllCache_Description
source: Clears all server-side caching. This may temporarily impact performance while cache is rebuilt.
ar_ly: يمسح كل ذاكرة التخزين المؤقت من جانب الخادم. قد يؤثر هذا مؤقتًا على الأداء أثناء إعادة بناء ذاكرة التخزين المؤقت.

source: Delete Old Audit Logs
ar_ly: حذف سجلات التدقيق القديمة

# DeleteOldAuditLogs_Description
source: Permanently removes audit logs older than the specified period to free up database space.
ar_ly: يزيل سجلات التدقيق الأقدم من الفترة المحددة بشكل دائم لتوفير مساحة في قاعدة البيانات.

source: Delete logs older than
ar_ly: حذف السجلات الأقدم من

source: 30 days
ar_ly: 30 يومًا

source: 60 days
ar_ly: 60 يومًا

source: 90 days
ar_ly: 90 يومًا

source: 6 months
ar_ly: 6 أشهر

source: 1 year
ar_ly: سنة واحدة

# DeleteOldLogs
source: Delete Logs
ar_ly: حذف السجلات القديمة

source: Generate Test Data
ar_ly: توليد بيانات اختبار

source: Low Risk
ar_ly: خطر منخفض

# GenerateTestData_Description
source: Generates random users, students, and data for testing purposes. Safe to use in development.
ar_ly: يولد مستخدمين وطلاب وبيانات عشوائية لأغراض الاختبار. آمن للاستخدام في التطوير.

source: Number of Users
ar_ly: عدد المستخدمين

source: Number of Students
ar_ly: عدد الطلاب

source: Generating...
ar_ly: جاري التوليد...

source: Reset Database to Defaults
ar_ly: إعادة تعيين قاعدة البيانات للافتراضيات

source: High Risk
ar_ly: خطر عالي

source: EXTREME CAUTION:
ar_ly: حذر شديد:

# ResetDatabase_Warning
source: This will wipe ALL data and restore the database to its initial state.
ar_ly: سيؤدي هذا إلى مسح جميع البيانات واستعادة قاعدة البيانات إلى حالتها الأولية.

# ResetDatabase_Description
source: All users, students, residences, and logs will be permanently deleted. Only the SuperRoot account will remain.
ar_ly: سيتم حذف جميع المستخدمين والطلاب والمساكن والسجلات بشكل دائم. سيبقى حساب SuperRoot فقط.

source: Resetting...
ar_ly: جاري إعادة التعيين...

source: Reset Database
ar_ly: إعادة تعيين قاعدة البيانات

# DeleteAllData_Header
source: Delete All Data
ar_ly: حذف جميع البيانات

source: Critical Risk
ar_ly: خطر حرج

# NuclearOption
source: THE NUCLEAR OPTION
ar_ly: الخيار النووي

# MostDestructiveAction
source: This is the most destructive action available.
ar_ly: هذا هو الإجراء الأكثر تدميراً المتاح.

# PermanentlyDeleteEverything
source: It will permanently delete EVERYTHING:
ar_ly: سيحذف بشكل دائم كل شيء:

# AllUsersExceptSuperRoot
source: All Users (except you)
ar_ly: جميع المستخدمين (باستثنائك)

# AllStudentsAndManagers
source: All Students & Managers
ar_ly: جميع الطلاب والمديرين

# AllResidencesAndRooms
source: All Residences & Rooms
ar_ly: جميع المساكن والغرف

# AllPaymentsAndComplaints
source: All Payments & Complaints
ar_ly: جميع المدفوعات والشكاوى

source: All Audit Logs
ar_ly: جميع سجلات التدقيق

# ActionCannotBeUndone
source: This action CANNOT be undone.
ar_ly: لا يمكن التراجع عن هذا الإجراء.

# MustTypeConfirmation
source: You must type the confirmation code below to proceed:
ar_ly: يجب عليك كتابة رمز التأكيد أدناه للمتابعة:

# DeleteAllData_ConfirmationLabel
source: Type 'DELETE_ALL_DATA_PERMANENTLY'
ar_ly: اكتب 'DELETE_ALL_DATA_PERMANENTLY'

# ConfirmationCodeMismatch
source: Confirmation code does not match.
ar_ly: رمز التأكيد غير مطابق.

# ConfirmationCodeHelper
source: Please type the code exactly as shown.
ar_ly: يرجى كتابة الرمز تمامًا كما هو موضح.

source: Deleting Everything...
ar_ly: جاري حذف كل شيء...

# DeleteEverythingButton
source: Delete Everything
ar_ly: حذف كل شيء

# ClearCache_Confirmation
source: Are you sure you want to clear all system cache?
ar_ly: هل أنت متأكد أنك تريد مسح كل ذاكرة التخزين المؤقت للنظام؟

source: Cache cleared successfully.
ar_ly: تم مسح ذاكرة التخزين المؤقت بنجاح.

source: Failed to clear cache.
ar_ly: فشل مسح ذاكرة التخزين المؤقت.

source: Error
ar_ly: خطأ

# DeleteOldLogs_Confirmation
source: Are you sure you want to delete audit logs older than {0} days?
ar_ly: هل أنت متأكد أنك تريد حذف سجلات التدقيق الأقدم من {0} يومًا؟

source: Delete Logs
ar_ly: حذف السجلات

# LogsDeletedSuccessfully
source: Logs older than {0} days deleted successfully.
ar_ly: تم حذف السجلات الأقدم من {0} يومًا بنجاح.

# TestDataGenerated
source: Generated {0} users and {1} students successfully.
ar_ly: تم توليد {0} مستخدمين و {1} طلاب بنجاح.

source: Failed to generate test data.
ar_ly: فشل توليد بيانات الاختبار.

# ResetDatabase_Confirmation
source: Are you sure you want to reset the database? This cannot be undone.
ar_ly: هل أنت متأكد أنك تريد إعادة تعيين قاعدة البيانات؟ لا يمكن التراجع عن هذا.

# ResetDatabase_Title
source: Reset Database
ar_ly: إعادة تعيين قاعدة البيانات

# DeleteAllData_FinalWarning
source: FINAL WARNING: You are about to delete ALL data in the system. This is your last chance to cancel.
ar_ly: تحذير نهائي: أنت على وشك حذف جميع البيانات في النظام. هذه فرصتك الأخيرة للإلغاء.

# DeleteEverythingButton_Final
source: Yes, Delete Everything
ar_ly: نعم، احذف كل شيء

# FinalWarning_Title
source: Final Warning
ar_ly: تحذير نهائي

# AllDataDeleted
source: All data deleted. System is now empty.
ar_ly: تم حذف جميع البيانات. النظام فارغ الآن.

source: Failed to delete data.
ar_ly: فشل حذف البيانات.

# SuperRoot_Dashboard_Title
source: SuperRoot Dashboard
ar_ly: لوحة تحكم SuperRoot

source: SuperRoot Control Panel
ar_ly: لوحة تحكم SuperRoot

# Full_System_Access
source: Full system access and control
ar_ly: وصول وتحكم كامل بالنظام

source: Danger Zone
ar_ly: منطقة الخطر

source: Total Users
ar_ly: إجمالي المستخدمين

source: Active Users
ar_ly: المستخدمون النشطون

source: Total Roles
ar_ly: إجمالي الأدوار

source: System Uptime
ar_ly: مدة تشغيل النظام

source: User Management
ar_ly: إدارة المستخدمين

source: Create New User
ar_ly: إنشاء مستخدم جديد

source: View All Users
ar_ly: عرض كل المستخدمين

source: Manage Inactive Users
ar_ly: إدارة المستخدمين غير النشطين

source: Role Management
ar_ly: إدارة الأدوار

source: Create New Role
ar_ly: إنشاء دور جديد

source: View All Roles
ar_ly: عرض كل الأدوار

source: Manage Permissions
ar_ly: إدارة الأذونات

source: System Settings
ar_ly: إعدادات النظام

source: Email Configuration
ar_ly: إعدادات البريد الإلكتروني

source: SMS Configuration
ar_ly: إعدادات الرسائل القصيرة

source: Database Tools
ar_ly: أدوات قاعدة البيانات

source: User created successfully!
ar_ly: تم إنشاء المستخدم بنجاح!

source: Role created successfully!
ar_ly: تم إنشاء الدور بنجاح!

# Danger_Zone_Warning
source: You are about to enter the Danger Zone. Actions here are irreversible and can affect the entire system.
ar_ly: أنت على وشك دخول منطقة الخطر. الإجراءات هنا لا يمكن التراجع عنها ويمكن أن تؤثر على النظام بأكمله.

source: I Understand
ar_ly: أنا أفهم

source: Warning
ar_ly: تحذير

# SystemSettings_Title
source: System Settings
ar_ly: إعدادات النظام

# SystemSettings_Header
source: System Settings
ar_ly: إعدادات النظام

# SystemSettings_Description
source: Configure system-wide settings and preferences
ar_ly: تكوين الإعدادات والتفضيلات على مستوى النظام

# Tab_General
source: General
ar_ly: عام

# Tab_Email
source: Email
ar_ly: البريد الإلكتروني

# Tab_SMS
source: SMS
ar_ly: الرسائل القصيرة

# Tab_Security
source: Security
ar_ly: الأمان

# Tab_Payment
source: Payment
ar_ly: الدفع

# Tab_Maintenance
source: Maintenance
ar_ly: الصيانة

# GeneralSettings_Header
source: General Settings
ar_ly: الإعدادات العامة

source: System Name
ar_ly: اسم النظام

# SystemName_Helper
source: The name displayed throughout the system
ar_ly: الاسم المعروض في جميع أنحاء النظام

source: System Email
ar_ly: البريد الإلكتروني للنظام

# SystemEmail_Helper
source: Default email for system notifications
ar_ly: البريد الإلكتروني الافتراضي لإشعارات النظام

source: System Phone
ar_ly: هاتف النظام

# SystemPhone_Helper
source: Contact phone number
ar_ly: رقم هاتف الاتصال

source: Default Language
ar_ly: اللغة الافتراضية

source: Default Currency
ar_ly: العملة الافتراضية

source: Save Changes
ar_ly: حفظ التغييرات

# EmailConfiguration_Header
source: Email Configuration
ar_ly: تكوين البريد الإلكتروني

# EmailConfiguration_Alert
source: Configure SMTP settings for sending emails from the system
ar_ly: تكوين إعدادات SMTP لإرسال رسائل البريد الإلكتروني من النظام

source: SMTP Host
ar_ly: مضيف SMTP

source: SMTP Port
ar_ly: منفذ SMTP

source: Username
ar_ly: اسم المستخدم

source: Password
ar_ly: كلمة المرور

# EnableSsl
source: Enable SSL/TLS
ar_ly: تفعيل SSL/TLS

source: Save Email Settings
ar_ly: حفظ إعدادات البريد الإلكتروني

source: Send Test Email
ar_ly: إرسال بريد إلكتروني تجريبي

# SMSConfiguration_Header
source: SMS Configuration
ar_ly: تكوين الرسائل القصيرة

# SMSConfiguration_Alert
source: Configure SMS gateway for sending notifications
ar_ly: تكوين بوابة الرسائل القصيرة لإرسال الإشعارات

source: SMS Provider
ar_ly: مزود خدمة الرسائل القصيرة

source: API Key
ar_ly: مفتاح API

source: API Secret
ar_ly: سر API

source: Sender Name
ar_ly: اسم المرسل

source: Enable SMS Notifications
ar_ly: تفعيل إشعارات الرسائل القصيرة

source: Save SMS Settings
ar_ly: حفظ إعدادات الرسائل القصيرة

source: Send Test SMS
ar_ly: إرسال رسالة قصيرة تجريبية

# SecuritySettings_Header
source: Security Settings
ar_ly: إعدادات الأمان

# PasswordMinLength
source: Minimum Password Length
ar_ly: الحد الأدنى لطول كلمة المرور

# SessionTimeout
source: Session Timeout (minutes)
ar_ly: مهلة الجلسة (دقائق)

source: Max Login Attempts
ar_ly: الحد الأقصى لمحاولات تسجيل الدخول

# LockoutDuration
source: Lockout Duration (minutes)
ar_ly: مدة القفل (دقائق)

source: Require Email Confirmation
ar_ly: طلب تأكيد البريد الإلكتروني

# EnableTwoFactorAuth
source: Enable Two-Factor Authentication
ar_ly: تفعيل المصادقة الثنائية

source: Log All User Actions
ar_ly: تسجيل جميع إجراءات المستخدم

source: Save Security Settings
ar_ly: حفظ إعدادات الأمان

# PaymentSettings_Header
source: Payment Settings
ar_ly: إعدادات الدفع

# DefaultMonthlyRent
source: Default Monthly Rent (LYD)
ar_ly: الإيجار الشهري الافتراضي (د.ل)

source: Late Fee Percentage (%)
ar_ly: نسبة رسوم التأخير (%)

source: Payment Due Days
ar_ly: أيام استحقاق الدفع

# PaymentReminderDays
source: Payment Reminder (days before)
ar_ly: تذكير الدفع (أيام قبل)

source: Allow Online Payment
ar_ly: السماح بالدفع عبر الإنترنت

source: Auto-Generate Invoices
ar_ly: إنشاء الفواتير تلقائيًا

source: Save Payment Settings
ar_ly: حفظ إعدادات الدفع

# MaintenanceMode_Header
source: Maintenance Mode
ar_ly: وضع الصيانة

# MaintenanceMode_Alert
source: <strong>Warning:</strong> Enabling maintenance mode will prevent all users (except SuperRoot) from accessing the system.
ar_ly: <strong>تحذير:</strong> تفعيل وضع الصيانة سيمنع جميع المستخدمين (باستثناء SuperRoot) من الوصول إلى النظام.

source: Enable Maintenance Mode
ar_ly: تفعيل وضع الصيانة

source: Maintenance Message
ar_ly: رسالة الصيانة

# MaintenanceMessage_Placeholder
source: The system is currently under maintenance. Please check back later.
ar_ly: النظام يخضع للصيانة حاليًا. يرجى التحقق لاحقًا.

# SaveSettings_Button
source: Save Settings
ar_ly: حفظ الإعدادات

source: Settings saved successfully!
ar_ly: تم حفظ الإعدادات بنجاح!

source: Sending test email...
ar_ly: جاري إرسال بريد إلكتروني تجريبي...

source: Sending test SMS...
ar_ly: جاري إرسال رسالة قصيرة تجريبية...

source: Track all system activities and changes
ar_ly: تتبع جميع أنشطة النظام والتغييرات

source: Export Logs
ar_ly: تصدير السجلات

source: Total Actions
ar_ly: إجمالي الإجراءات

source: Today
ar_ly: اليوم

source: Failed Actions
ar_ly: الإجراءات الفاشلة

source: Action Type
ar_ly: نوع الإجراء

source: Create
ar_ly: إنشاء

source: Update
ar_ly: تحديث

source: Delete
ar_ly: حذف

source: View
ar_ly: عرض

source: Login
ar_ly: تسجيل دخول

source: Entity
ar_ly: الكيان

source: User
ar_ly: مستخدم

source: Student
ar_ly: طالب

source: Manager
ar_ly: مدير

source: Room
ar_ly: غرفة

source: Payment
ar_ly: دفعة

source: Complaint
ar_ly: شكوى

source: Date Range
ar_ly: نطاق التاريخ

source: Timestamp
ar_ly: الطابع الزمني

source: Action
ar_ly: الإجراء

source: Details
ar_ly: التفاصيل

source: IP Address
ar_ly: عنوان IP

source: Additional Info
ar_ly: معلومات إضافية

source: Logs refreshed successfully
ar_ly: تم تحديث السجلات بنجاح

source: Failed to load logs
ar_ly: فشل تحميل السجلات

source: Viewing details for
ar_ly: عرض تفاصيل لـ

source: Exporting logs...
ar_ly: جاري تصدير السجلات...

source: Active Users
ar_ly: المستخدمين النشطين

source: Search
ar_ly: بحث

source: Residences
ar_ly: المساكن

# Admin_Colleges_Title
source: Colleges Management
ar_ly: إدارة الكليات

source: Nationalities
ar_ly: الجنسية

source: User Email
ar_ly: بريد المستخدم

# ResidenceDetailsDialog_Title
source: Residence Details
ar_ly: تفاصسل السكن

# EditResidenceDialog_Title
source: Edit Residence Info
ar_ly: تعديل بيانات السكن

# ResidencesManagement_Snackbar_NotFound
source: Residences Not Found
ar_ly: لم يتم إيجاد السكن

# EditStudent_Title
source: Edit Student
ar_ly: تعديل طالب

# StudentDetails_Title
source: Student Details
ar_ly: تفاصيل الطالب

source: Student not found!
ar_ly: لم يتم العثور على الطالب!

source: First Name
ar_ly: الاسم الأول

source: Last Name
ar_ly: اسم العائلة

source: Phone Number
ar_ly: رقم الهاتف

source: Street Address
ar_ly: عنوان الشارع

source: City
ar_ly: المدينة

source: State
ar_ly: الولاية

source: Postal Code
ar_ly: الرمز البريدي

source: Country
ar_ly: الدولة

# StudentUpdatedSuccess
source: Student updated successfully!
ar_ly: تم تحديث الطالب بنجاح!

# StudentUpdateFailed
source: Failed to update student.
ar_ly: فشل تحديث الطالب.

# ErrorLoadingStudent
source: Error loading student: {0}
ar_ly: خطأ في تحميل بيانات الطالب: {0}

source: Student ID
ar_ly: معرف الطالب

source: Email
ar_ly: البريد

source: Address
ar_ly: العنوان

source: Close
ar_ly: إغلاق

# Help_PageTitle
source: Help & Support - SRMS
ar_ly: المساعدة والدعم - SRMS

# Help_Header
source: Help Center
ar_ly: مركز المساعدة

# Help_Subtitle
source: Find answers, tutorials, and support for all your needs
ar_ly: اعثر على الإجابات والدروس والدعم لجميع احتياجاتك

# Help_SearchPlaceholder
source: Search for articles, guides, and more...
ar_ly: ابحث عن مقالات، أدلة، والمزيد...

# Help_QuickActions
source: Quick Actions
ar_ly: إجراءات سريعة

# Help_ContactSupport_Title
source: Contact Support
ar_ly: اتصل بالدعم

# Help_ContactSupport_Desc
source: Get help from our support team
ar_ly: احصل على المساعدة من فريق الدعم لدينا

# Help_LiveChat_Title
source: Live Chat
ar_ly: المحادثة المباشرة

# Help_LiveChat_Desc
source: Chat with a support agent now
ar_ly: تحدث مع وكيل الدعم الآن

# Help_Documentation_Title
source: Documentation
ar_ly: التوثيق

# Help_Documentation_Desc
source: Read comprehensive guides
ar_ly: قراءة أدلة شاملة

# Help_VideoTutorials_Title
source: Video Tutorials
ar_ly: دروس فيديو

# Help_VideoTutorials_Desc
source: Watch step-by-step videos
ar_ly: شاهد مقاطع فيديو خطوة بخطوة

# Help_FAQ_Title
source: Frequently Asked Questions
ar_ly: الأسئلة الشائعة

# Help_ContactInformation
source: Contact Information
ar_ly: معلومات الاتصال

# Help_Email_Label
source: Email Support
ar_ly: دعم البريد الإلكتروني

# Help_Phone_Label
source: Phone Support
ar_ly: الدعم الهاتفي

# Help_Address_Label
source: Office Address
ar_ly: عنوان المكتب

# Help_SupportHours_Label
source: Support Hours
ar_ly: ساعات الدعم

# Help_SystemStatus_Title
source: System Status
ar_ly: حالة النظام

# Help_Status_Online
source: Operational
ar_ly: يعمل

# Help_PopularTopics
source: Popular Topics
ar_ly: مواضيع شائعة

# Help_Articles_Count
source: {0} Articles
ar_ly: {0} مقالات

# Faq1_Q
source: How do I book a room?
ar_ly: كيف أحجز غرفة؟

# Faq1_A
source: You can book a room by navigating to the 'Student Residences' page, selecting a residence, and choosing an available room.
ar_ly: يمكنك حجز غرفة بالانتقال إلى صفحة 'سكن الطلاب'، واختيار سكن، واختيار غرفة متاحة.

# Faq2_Q
source: How can I pay my dues?
ar_ly: كيف يمكنني دفع مستحقاتي؟

# Faq2_A
source: Go to 'My Payments' to view your pending dues and make secure payments online using credit card or bank transfer.
ar_ly: اذهب إلى 'مدفوعاتي' لعرض مستحقاتك المعلقة وإجراء مدفوعات آمنة عبر الإنترنت باستخدام بطاقة الائتمان أو التحويل المصرفي.

# Faq3_Q
source: How do I report a maintenance issue?
ar_ly: كيف أبلغ عن مشكلة صيانة؟

# Faq3_A
source: Visit 'My Complaints', click 'New Complaint', and fill in the details of the issue. You can track the status of your request there.
ar_ly: قم بزيارة 'شكاوي'، انقر فوق 'شكوى جديدة'، واملأ تفاصيل المشكلة. يمكنك تتبع حالة طلبك هناك.

# Faq4_Q
source: Can I change my password?
ar_ly: هل يمكنني تغيير كلمة المرور الخاصة بي؟

# Faq4_A
source: Yes, go to 'Profile' settings and look for the 'Security' section to update your password.
ar_ly: نعم، اذهب إلى إعدادات 'الملف الشخصي' وابحث عن قسم 'الأمان' لتحديث كلمة المرور الخاصة بك.

# Faq5_Q
source: Can I change my room?
ar_ly: هل يمكنني تغيير غرفتي؟

# Error_LoadingStudentData
source: Error loading student data: {0}
ar_ly: خطأ في تحميل بيانات الطالب: {0}

# Error_LoadingComplaints
source: Error loading complaints: {0}
ar_ly: خطأ في تحميل الشكاوى: {0}

# MyComplaints_PageTitle
source: My Complaints - SRMS
ar_ly: شكاوي - SRMS

# MyComplaints_Header
source: My Complaints
ar_ly: شكاوي

# MyComplaints_Subtitle
source: Submit and track your maintenance requests
ar_ly: تقديم ومتابعة طلبات الصيانة

# MyComplaints_NewComplaint
source: NEW COMPLAINT
ar_ly: شكوى جديدة

# MyComplaints_Stat_Total
source: Total
ar_ly: العدد الكلي

# MyComplaints_Stat_Open
source: Open
ar_ly: مفتوحة

# MyComplaints_Stat_InProgress
source: In Progress
ar_ly: قيد التنفيذ

# MyComplaints_Stat_Resolved
source: Resolved
ar_ly: تم الحل

# MyComplaints_NoComplaints
source: No complaints yet
ar_ly: لا توجد شكاوى حتى الآن

# MyComplaints_NoComplaintsSub
source: Click 'New Complaint' to submit your first complaint
ar_ly: اضغط على 'شكوى جديدة' لتقديم شكواك الأولى

# MyComplaints_Table_ID
source: ID
ar_ly: المعرف

# MyComplaints_Table_Subject
source: Subject
ar_ly: الموضوع

# MyComplaints_Table_Category
source: Category
ar_ly: الفئة

# MyComplaints_Table_Date
source: Date
ar_ly: التاريخ

# MyComplaints_Table_Status
source: Status
ar_ly: الحالة

# MyComplaints_Table_Priority
source: Priority
ar_ly: الأولوية

# MyComplaints_LoginRequired
source: Please login to view your complaints.
ar_ly: يرجى تسجيل الدخول لعرض الشكاوى الخاصة بك.

# Error_EmailNotFound
source: Could not get your email. Please contact support.
ar_ly: تعذر الحصول على بريدك الإلكتروني. يرجى الاتصال بالدعم.

# MyComplaints_ProfileCreated
source: Your student profile has been created successfully!
ar_ly: تم إنشاء ملف الطالب الخاص بك بنجاح!

# MyComplaints_UserAccountNotFound
source: Could not find your user account. Please contact support.
ar_ly: تعذر العثور على حساب المستخدم الخاص بك. يرجى الاتصال بالدعم.

# MyComplaints_UnableToIdentifyStudent
source: Unable to identify your student account. Please refresh the page.
ar_ly: تعذر التعرف على حساب الطالب الخاص بك. يرجى تحديث الصفحة.

# MyComplaints_NoActiveReservation
source: You do not have an active reservation to submit a complaint.
ar_ly: ليس لديك حجز نشط لتقديم شكوى.

# MyComplaints_CheckReservationError
source: Error checking reservation status: {0}
ar_ly: خطأ في التحقق من حالة الحجز: {0}

# MyComplaints_SubmitSuccess
source: Complaint submitted successfully! Managers have been notified.
ar_ly: تم تقديم الشكوى بنجاح! تم إخطار المديرين.

# MyComplaints_SubmitError
source: Error submitting complaint: {0}
ar_ly: خطأ في تقديم الشكوى: {0}

# MyPayments_PageTitle
source: My Payments - SRMS
ar_ly: مدفوعاتي - SRMS

# MyPayments_Header
source: My Payments
ar_ly: مدفوعاتي

# MyPayments_Subtitle
source: Track your payment history and pending dues
ar_ly: تتبع سجل الدفعات والمستحقات المعلقة

# MyPayments_MakePayment
source: Make Payment
ar_ly: إجراء دفعة

# MyPayments_PendingDues
source: Pending Dues
ar_ly: المستحقات المعلقة

# MyPayments_TotalPaid
source: Total Paid
ar_ly: إجمالي المدفوع

# MyPayments_Transactions
source: Transactions
ar_ly: المعاملات

# MyPayments_Table_Date
source: Date
ar_ly: التاريخ

# MyPayments_Table_Description
source: Description
ar_ly: الوصف

# MyPayments_Table_Amount
source: Amount
ar_ly: المبلغ

# MyPayments_Table_Status
source: Status
ar_ly: الحالة

# MyPayments_Table_Action
source: Action
ar_ly: إجراء

# Reservation_LoadingRoom
source: Loading room details...
ar_ly: جاري تحميل تفاصيل الغرفة...

# Reservation_Error_StudentIdMissing
source: Could not retrieve student ID from authentication. Cannot proceed with reservation.
ar_ly: تعذر استرداد معرف الطالب من المصادقة. لا يمكن متابعة الحجز.

# Reservation_Error_NotAuthenticated
source: User not authenticated. Cannot proceed with reservation.
ar_ly: المستخدم غير مصادق عليه. لا يمكن متابعة الحجز.

# Reservation_Error_RoomMismatch
source: Room does not belong to the specified residence.
ar_ly: الغرفة لا تنتمي إلى السكن المحدد.

# Reservation_Error_FetchRoom
source: Error fetching room details: {0}
ar_ly: خطأ في جلب تفاصيل الغرفة: {0}

# Reservation_Error_SelectDates
source: Please select both start and end dates.
ar_ly: يرجى تحديد تاريخي البدء والانتهاء.

# Reservation_Error_EndDateBeforeStartDate
source: End Date must be after Start Date.
ar_ly: تاريخ الانتهاء يجب أن يكون بعد تاريخ البدء.

# Reservation_Error_RentNotAvailable
source: Room monthly rent not available to calculate fee.
ar_ly: إيجار الغرفة الشهري غير متاح لحساب الرسوم.

# Reservation_Error_StudentIdMissingAction
source: Student ID is missing. Cannot make reservation.
ar_ly: معرف الطالب مفقود. لا يمكن إجراء الحجز.

# Reservation_Error_RoomDetailsMissing
source: Room details are missing. Cannot make reservation.
ar_ly: تفاصيل الغرفة مفقودة. لا يمكن إجراء الحجز.

# Reservation_Error_InvalidDates
source: Please select valid dates.
ar_ly: يرجى تحديد تواريخ صالحة.
