Repository: alhabib3031/StudentResidenceManagementSystemSRMS
Catalog: SRMS.WebUI.Server/Resources/Resource.*.resx
Languages: ar_ly

source: Settings
ar_ly: الإعدادات

source: General Settings
ar_ly: الإعدادات العامة

source: Save General Settings
ar_ly: حفظ الإعدادات العامة

source: Notification Settings
ar_ly: إعدادات الإشعارات

source: Save Notification Settings
ar_ly: حفظ إعدادات الإشعارات

source: Appearance
ar_ly: المظهر

source: Save Appearance Settings
ar_ly: حفظ إعدادات المظهر

source: Privacy & Security
ar_ly: الخصوصية والأمان

source: Data Management
ar_ly: إدارة البيانات

source: Export My Data
ar_ly: تصدير بياناتي

source: Clear Cache
ar_ly: مسح الذاكرة المؤقتة

source: Delete Account
ar_ly: حذف الحساب

source: Welcome
ar_ly: مرحبا

source: Language
ar_ly: اللغة

source: English
ar_ly: الإنجليزية

source: Arabic
ar_ly: العربية

source: French
ar_ly: الفرنسية

source: Timezone
ar_ly: المنطقة الزمنية

# EST
source: Eastern Time
ar_ly: التوقيت الشرقي

# PST
source: Pacific Time
ar_ly: توقيت المحيط الهادئ

source: Date Format
ar_ly: تنسيق التاريخ

source: Email Notifications
ar_ly: الإشعارات عبر البريد الإلكتروني

# Desc_EmailNotifications
source: Receive notifications via email.
ar_ly: تلقي الإشعارات عبر البريد الإلكتروني.

# Contact_PageTitle
source: Contact Us - SRMS
ar_ly: اتصل بنا - SRMS

# Contact_GetInTouch
source: Get In Touch
ar_ly: تواصل معنا

# Contact_Subtitle
source: We'd love to hear from you. Send us a message and we'll respond as soon as possible.
ar_ly: نود سماع رأيك. أرسل لنا رسالة وسنرد عليك في أقرب وقت ممكن.

# Contact_SendUsMessage
source: Send Us a Message
ar_ly: أرسل لنا رسالة

# Contact_Label_FirstName
source: First Name
ar_ly: الاسم الأول

# Contact_Label_LastName
source: Last Name
ar_ly: اسم العائلة

# Contact_Label_Email
source: Email Address
ar_ly: عنوان البريد الإلكتروني

# Contact_Label_Phone
source: Phone Number
ar_ly: رقم الهاتف

# Contact_Label_Subject
source: Subject
ar_ly: الموضوع

# Contact_Subject_GeneralInquiry
source: General Inquiry
ar_ly: استعلام عام

# Contact_Subject_TechnicalSupport
source: Technical Support
ar_ly: الدعم الفني

# Contact_Subject_BillingQuestion
source: Billing Question
ar_ly: سؤال فوترة

# Contact_Subject_FeatureRequest
source: Feature Request
ar_ly: طلب ميزة

# Contact_Subject_BugReport
source: Bug Report
ar_ly: تقرير خطأ

# Contact_Subject_Partnership
source: Partnership
ar_ly: شراكة

# Contact_Subject_Other
source: Other
ar_ly: أخرى

# Contact_Label_Message
source: Message
ar_ly: الرسالة

# Contact_Terms_Prefix
source: I agree to the
ar_ly: أوافق على

source: Terms of Service
ar_ly: شروط الخدمة

source: Privacy Policy
ar_ly: سياسة الخصوصية

# Contact_And
source: and
ar_ly: و

# Contact_Button_Reset
source: Reset
ar_ly: إعادة تعيين

# Contact_Button_SendMessage
source: Send Message
ar_ly: إرسال الرسالة

# Contact_ContactInformation
source: Contact Information
ar_ly: معلومات الاتصال

# Contact_Address
source: Address
ar_ly: العنوان

# Contact_Phone
source: Phone
ar_ly: الهاتف

# Contact_Email
source: Email
ar_ly: البريد الإلكتروني

# Contact_BusinessHours
source: Business Hours
ar_ly: ساعات العمل

# Contact_FollowUs
source: Follow Us
ar_ly: تابعنا

# Contact_QuickLinks
source: Quick Links
ar_ly: روابط سريعة

# Contact_QuickLinks_HelpCenter
source: Help Center
ar_ly: مركز المساعدة

# Contact_QuickLinks_AboutUs
source: About Us
ar_ly: معلومات عنا

# Contact_QuickLinks_Documentation
source: Documentation
ar_ly: التوثيق

# Contact_Snackbar_AgreeTerms
source: Please agree to the terms and conditions
ar_ly: يرجى الموافقة على الشروط والأحكام

# Contact_Snackbar_Thanks
source: Thank you for your message! We'll get back to you soon.
ar_ly: شكراً لرسالتك! سنعاود الاتصال بك قريباً.

# Home_Title
source: Welcome to SRMS
ar_ly: مرحبًا بك في SRMS

# Home_Subtitle
source: Modern Student Residence Management System
ar_ly: نظام إدارة مساكن الطلاب الحديث

# Home_Lead
source: Organize student housing operations with our cloud-first platform. Manage residences, students, payments and more — all in one place.
ar_ly: نظم عمليات السكن الطلابي باستخدام منصتنا الشاملة والسحابية. قم بإدارة المساكن والطلاب والمدفوعات والمزيد — كل ذلك في مكان واحد.

source: Get Started Free
ar_ly: ابدأ مجانًا

source: Learn More
ar_ly: اعرف المزيد

# Features_Header
source: Everything you need to manage student housing
ar_ly: كل ما تحتاجه لإدارة سكن الطلاب

# Feature_ResidenceManagement_Title
source: Residence Management
ar_ly: إدارة المساكن

# Feature_ResidenceManagement_Desc
source: Multi-residence, room and facility management with an intuitive interface.
ar_ly: إدارة متعددة للمساكن والغرف والمرافق بكفاءة عبر واجهة سهلة الاستخدام.

# Feature_StudentPortal_Title
source: Student Portal
ar_ly: بوابة الطلاب

# Feature_StudentPortal_Desc
source: Empower students with self-service tools for room selection, payments and support.
ar_ly: تمكين الطلاب بأدوات الخدمة الذاتية لاختيار الغرف والمدفوعات والدعم.

# Feature_PaymentProcessing_Title
source: Payment Processing
ar_ly: معالجة المدفوعات

# Feature_PaymentProcessing_Desc
source: Secure and automated payment collection with multiple payment method support.
ar_ly: جمع مدفوعات آمن وآلي مع دعم طرق دفع متعددة.

# Feature_ComplaintManagement_Title
source: Complaint Management
ar_ly: إدارة الشكاوى

# Feature_ComplaintManagement_Desc
source: Track and resolve student complaints efficiently with a ticketing workflow.
ar_ly: تتبع وحل شكاوى الطلاب بكفاءة عبر نظام التذاكر.

# Feature_Analytics_Title
source: Analytics & Reports
ar_ly: التحليلات والتقارير

# Feature_Analytics_Desc
source: Gain insights with comprehensive reports and live dashboards.
ar_ly: الحصول على رؤى من خلال تقارير شاملة ولوحات تحكم آنية.

# Feature_Security_Title
source: Security & Privacy
ar_ly: الأمان والخصوصية

# Feature_Security_Desc
source: Enterprise-grade security with role-based access control and audit logging.
ar_ly: أمان بمستوى المؤسسات مع تحكم في الوصول حسب الأدوار وتسجيل تدقيق.

# Stats_ActiveStudents
source: Active Students
ar_ly: الطلاب النشطين

# Stats_Residences
source: Residences
ar_ly: المساكن

# Stats_Uptime
source: Uptime
ar_ly: التوافر

# Stats_Support
source: Support
ar_ly: الدعم

# CTA_Header
source: Ready to transform student housing?
ar_ly: هل أنت جاهز لتحويل سكن الطلاب؟

# CTA_Body
source: Join thousands of institutions that trust SRMS to manage student housing efficiently and effectively.
ar_ly: انضم إلى آلاف المؤسسات التي تثق في SRMS لإدارة مساكن طلابها بكفاءة وفعالية.

source: Sign Up Now
ar_ly: سجل الآن

source: Contact Sales
ar_ly: اتصل بالمبيعات

# Brand_Subtitle
source: Student Residence Management
ar_ly: إدارة مساكن الطلاب

source: Super Root Panel
ar_ly: لوحة المسؤول العليا

source: Dashboard
ar_ly: لوحة التحكم

source: Manage Users
ar_ly: إدارة المستخدمين

source: Manage Roles
ar_ly: إدارة الأدوار

source: System Settings
ar_ly: إعدادات النظام

source: Audit Logs
ar_ly: سجلات التدقيق

source: Administration
ar_ly: الإدارة

source: Admin Dashboard
ar_ly: لوحة إدارة

# ManagersLabel
source: Managers
ar_ly: المديرون

source: Reports
ar_ly: التقارير

source: Management
ar_ly: الإدارة

source: Manager Dashboard
ar_ly: لوحة المدير

# StudentsLabel
source: Students
ar_ly: الطلاب

# RoomsLabel
source: Rooms
ar_ly: الغرف

# ComplaintsLabel
source: Complaints
ar_ly: الشكاوى

# PaymentsLabel
source: Payments
ar_ly: المدفوعات

# StudentPortalLabel
source: Student Portal
ar_ly: بوابة الطلاب

source: My Dashboard
ar_ly: لوحاتي

source: My Profile
ar_ly: ملفي

source: My Room
ar_ly: غرفتي

source: My Payments
ar_ly: مدفوعاتي

source: My Complaints
ar_ly: شكاوي

source: Help & Support
ar_ly: مساعدة ودعم

source: Home
ar_ly: الرئيسية

source: About Us
ar_ly: معلومات عنا

source: Contact
ar_ly: اتصل

source: Help
ar_ly: مساعدة

source: Sign In
ar_ly: تسجيل الدخول

source: Register
ar_ly: التسجيل

# VersionInfo
source: Version 1.0.0
ar_ly: الإصدار 1.0.0

# Copyright
source: © 2025 SRMS. All rights reserved.
ar_ly: © 2025 SRMS. جميع الحقوق محفوظة.

# Desc_DarkMode
source: Enable dark mode for the user interface.
ar_ly: تفعيل الوضع الداكن لواجهة المستخدم.

# Desc_CompactMode
source: Enable compact mode for the user interface.
ar_ly: تفعيل الوضع المضغوط لواجهة المستخدم.

# Login_PageTitle
source: Login - SRMS
ar_ly: تسجيل الدخول - SRMS

# Login_CheckingAuth
source: Checking authentication...
ar_ly: جارٍ التحقق من المصادقة...

# Login_WelcomeBack
source: Welcome Back
ar_ly: مرحباً بعودتك

# Login_SignInAccess
source: Sign in to access your account
ar_ly: تسجيل الدخول للوصول إلى حسابك

# Login_Label_EmailAddress
source: Email Address
ar_ly: عنوان البريد الإلكتروني

# Login_Label_Password
source: Password
ar_ly: كلمة المرور

# Login_RememberMe
source: Remember me
ar_ly: تذكرني

# Login_ForgotPassword
source: Forgot Password?
ar_ly: نسيت كلمة المرور؟

# Login_Button_SignIn
source: Sign In
ar_ly: تسجيل الدخول

# Login_OR
source: OR
ar_ly: أو

# Login_Button_SignInWithGoogle
source: Sign in with Google
ar_ly: تسجيل الدخول عبر Google

# Login_Question_NoAccount
source: Don't have an account?
ar_ly: ليس لديك حساب؟

# Login_CreateAccount
source: Create an account
ar_ly: إنشاء حساب

# Login_TestAccountLabel
source: Test Account:
ar_ly: حساب تجريبي:

# Login_Error_InvalidCredentials
source: Invalid email or password.
ar_ly: البريد الإلكتروني أو كلمة المرور غير صحيحة.

# Login_Error_LockedOut
source: Account is locked out.
ar_ly: الحساب مقفل.

# Login_Error_GoogleAuthFailed
source: Google authentication failed.
ar_ly: فشل مصادقة Google.

# Login_Error_NoEmailFromGoogle
source: Could not retrieve email from Google.
ar_ly: تعذّر استرداد البريد الإلكتروني من Google.

# Login_Error_UserNotFound
source: User not found. Please register first.
ar_ly: المستخدم غير موجود. الرجاء التسجيل أولاً.

# Login_Error_Default
source: An error occurred during login.
ar_ly: حدث خطأ أثناء تسجيل الدخول.

# Logout_PageTitle
source: Logout - SRMS
ar_ly: تسجيل الخروج - SRMS

# Logout_LoggingOut
source: Logging Out
ar_ly: تسجيل الخروج

# Logout_PleaseWait
source: Please wait while we log you out...
ar_ly: يرجى الانتظار أثناء تسجيل خروجك...

# Logout_RedirectMessage
source: You will be redirected to the login page shortly
ar_ly: سيتم توجيهك إلى صفحة تسجيل الدخول قريبًا

# Faq5_A
source: Room changes are subject to availability and approval. Contact your residence manager to request a room change. They will review your request and inform you of the decision.
ar_ly: تخضع تغييرات الغرف للتوافر والموافقة. اتصل بمدير السكن لطلب تغيير الغرفة. سيقومون بمراجعة طلبك وإبلاغك بالقرار.

# Error_PageTitle
source: Error
ar_ly: خطأ

# Error_Header
source: Error.
ar_ly: خطأ.

# Error_ProcessingMessage
source: An error occurred while processing your request.
ar_ly: حدث خطأ أثناء معالجة طلبك.

# Error_RequestId
source: Request ID:
ar_ly: معرّف الطلب:

# Error_DevelopmentMode_Title
source: Development Mode
ar_ly: وضع التطوير

# Error_DevelopmentMode_Desc1
source: Swapping to the <strong>Development</strong> environment will display more detailed information about the error that occurred.
ar_ly: التبديل إلى بيئة <strong>التطوير</strong> سيعرض معلومات أكثر تفصيلاً حول الخطأ الذي حدث.

# Error_DevelopmentMode_Desc2
source: <strong>The Development environment shouldn't be enabled for deployed applications.</strong> It can result in displaying sensitive information from exceptions to end users. For local debugging, enable the <strong>Development</strong> environment by setting the <strong>ASPNETCORE_ENVIRONMENT</strong> environment variable to <strong>Development</strong> and restarting the app.
ar_ly: <strong>لا ينبغي تمكين بيئة التطوير للتطبيقات المنشورة.</strong> قد يؤدي ذلك إلى عرض معلومات حسّاسة من الاستثناءات لمستخدمي الواجهة. للتصحيح المحلي، قم بتعيين المتغير البيئي <strong>ASPNETCORE_ENVIRONMENT</strong> إلى <strong>Development</strong> وأعد تشغيل التطبيق.

# VerifyEmail_PageTitle
source: Verify Email - SRMS
ar_ly: التحقق من البريد الإلكتروني - SRMS

# VerifyEmail_Header
source: Verify Email
ar_ly: التحقق من البريد الإلكتروني

# VerifyEmail_VerifyingTitle
source: Verifying Your Email
ar_ly: جارٍ التحقق من بريدك الإلكتروني

# VerifyEmail_VerifyingMessage
source: Please wait while we verify your account...
ar_ly: يرجى الانتظار أثناء التحقق من حسابك...

# VerifyEmail_Success_Title
source: Successfully Verified!
ar_ly: تم التحقق بنجاح!

# VerifyEmail_Success_Message
source: Your email has been successfully verified. Welcome to the Student Residence Management System!
ar_ly: تم التحقق من بريدك الإلكتروني بنجاح. مرحبًا بك في نظام إدارة مساكن الطلاب!

# VerifyEmail_Button_LoginNow
source: Login Now
ar_ly: تسجيل الدخول الآن

# VerifyEmail_Error_AlertTitle
source: Verification Failed
ar_ly: فشل التحقق

# VerifyEmail_Error_DefaultMessage
source: Email verification failed. The verification code may be invalid or expired.
ar_ly: فشل التحقق من البريد الإلكتروني. قد يكون رمز التحقق غير صالح أو منتهي.

# VerifyEmail_Error_InvalidFormat
source: Invalid verification link format. Please check the link and try again.
ar_ly: تنسيق رابط التحقق غير صالح. يرجى التحقق من الرابط والمحاولة مرة أخرى.

# VerifyEmail_Error_Exception
source: An error occurred during verification: {0}
ar_ly: حدث خطأ أثناء التحقق: {0}

# VerifyEmail_Button_TryRegister
source: Try Registering Again
ar_ly: حاول التسجيل مرة أخرى

# VerifyEmail_NeedHelp_Text
source: Need help? Contact support or try these options:
ar_ly: هل تحتاج مساعدة؟ اتصل بالدعم أو جرّب هذه الخيارات:

# VerifyEmail_Button_BackToLogin
source: Back to Login
ar_ly: عودة إلى تسجيل الدخول

# VerifyEmail_Button_ContactSupport
source: Contact Support
ar_ly: اتصل بالدعم

# VerifyEmail_Snackbar_Success
source: Email verified successfully! Welcome to SRMS.
ar_ly: تم التحقق من البريد الإلكتروني بنجاح! مرحبًا بك في SRMS.

# ResetPassword_PageTitle
source: Reset Password - SRMS
ar_ly: إعادة تعيين كلمة المرور - SRMS

# ResetPassword_InvalidLink_Title
source: Invalid Reset Link
ar_ly: رابط إعادة التعيين غير صالح

# ResetPassword_InvalidLink_Message
source: This password reset link is invalid or has expired. Please request a new one.
ar_ly: هذا الرابط لإعادة تعيين كلمة المرور غير صالح أو منتهي. يرجى طلب رابط جديد.

# ResetPassword_RequestNewLink
source: Request a new reset link
ar_ly: طلب رابط إعادة تعيين جديد

# ResetPassword_Header_ResetYourPassword
source: Reset Your Password
ar_ly: إعادة تعيين كلمة المرور

# ResetPassword_EnterNewPassword
source: Enter your new password below
ar_ly: أدخل كلمة المرور الجديدة أدناه

# ResetPassword_Label_NewPassword
source: New Password
ar_ly: كلمة المرور الجديدة

# ResetPassword_Label_ConfirmPassword
source: Confirm New Password
ar_ly: تأكيد كلمة المرور الجديدة

# ResetPassword_Helper_PasswordRules
source: Min 8 characters, uppercase, lowercase, number, special symbol
ar_ly: الحد الأدنى 8 أحرف، حرف كبير، حرف صغير، رقم، رمز خاص

# ResetPassword_PasswordStrengthPrefix
source: Password strength: {0}
ar_ly: قوة كلمة المرور: {0}

# ResetPassword_Button_Resetting
source: Resetting password...
ar_ly: جارٍ إعادة تعيين كلمة المرور...

# ResetPassword_Button_ResetPassword
source: Reset Password
ar_ly: إعادة تعيين كلمة المرور

# ResetPassword_Button_BackToLogin
source: Back to Login
ar_ly: العودة إلى تسجيل الدخول

# ResetPassword_Success_Title
source: Password Reset Successful!
ar_ly: تمت إعادة تعيين كلمة المرور بنجاح!

# ResetPassword_Success_Subtitle
source: Your password has been successfully reset. You can now log in with your new password.
ar_ly: تمت إعادة تعيين كلمة المرور بنجاح. يمكنك الآن تسجيل الدخول بكلمة المرور الجديدة.

# ResetPassword_Button_GoToLogin
source: Go to Login
ar_ly: الانتقال إلى تسجيل الدخول

# ResetPassword_Error_PasswordsMismatch
source: Passwords do not match!
ar_ly: كلمات المرور غير متطابقة!

# ResetPassword_Snackbar_ResetSuccess
source: Password reset successfully! Redirecting to login...
ar_ly: تمت إعادة تعيين كلمة المرور بنجاح! جارٍ إعادة التوجيه لتسجيل الدخول...

# ResetPassword_Error_FailedReset
source: Failed to reset password. The link may be expired or invalid.
ar_ly: فشل إعادة تعيين كلمة المرور. قد يكون الرابط منتهيًا أو غير صالح.

# ResetPassword_Error_GenericException
source: An error occurred: {0}
ar_ly: حدث خطأ: {0}

# Register_PageTitle
source: Register - SRMS
ar_ly: التسجيل - SRMS

# Register_CheckingAuth
source: Checking authentication...
ar_ly: جارٍ التحقق من المصادقة...

# Register_Header_CreateAccount
source: Create Your Account
ar_ly: إنشاء حسابك

# Register_Subtitle_Join
source: Join the Student Residence Management System
ar_ly: انضم إلى نظام إدارة مساكن الطلاب

# Register_PersonalInformation
source: Personal Information
ar_ly: المعلومات الشخصية

# Register_ContactInformation
source: Contact Information
ar_ly: معلومات الاتصال

# Register_AdditionalInformation
source: Additional Information
ar_ly: معلومات إضافية

# Register_Security
source: Security
ar_ly: الأمان

# Register_Label_FirstName
source: First Name
ar_ly: الاسم الأول

# Register_Label_LastName
source: Last Name
ar_ly: اسم العائلة

# Register_Label_Email
source: Email Address
ar_ly: عنوان البريد الإلكتروني

# Register_Helper_EmailVerification
source: We'll send a verification link to this email
ar_ly: سنرسل رابط تحقق إلى هذا البريد الإلكتروني

# Register_Label_Phone
source: Phone Number
ar_ly: رقم الهاتف

# Register_Label_NationalId
source: National ID
ar_ly: الهوية الوطنية

# Register_Label_DateOfBirth
source: Date of Birth
ar_ly: تاريخ الميلاد

# Register_Label_Password
source: Password
ar_ly: كلمة المرور

# Register_Label_ConfirmPassword
source: Confirm Password
ar_ly: تأكيد كلمة المرور

# Register_Helper_PasswordRules
source: Min 8 characters: uppercase, lowercase, number & special symbol
ar_ly: الحد الأدنى 8 أحرف: حرف كبير، حرف صغير، رقم ورمز خاص

# Register_PasswordStrength_Prefix
source: Password strength:
ar_ly: قوة كلمة المرور:

# Register_Button_CreatingAccount
source: Creating your account...
ar_ly: جارٍ إنشاء حسابك...

# Register_Button_CreateAccount
source: Create Account
ar_ly: إنشاء حساب

# Register_OR
source: OR
ar_ly: أو

# Register_AlreadyHaveAccount
source: Already have an account?
ar_ly: هل لديك حساب بالفعل؟

# Register_Button_SignInInstead
source: Sign in instead
ar_ly: تسجيل الدخول بدلاً من ذلك

# About_PageTitle
source: About Us - SRMS
ar_ly: من نحن - SRMS

# About_Header
source: About SRMS
ar_ly: حول SRMS

# About_Subtitle
source: Revolutionizing student residence management with cutting-edge technology and exceptional service
ar_ly: ثورة في إدارة مساكن الطلاب بتقنية متطورة وخدمة استثنائية

# About_Vision_Title
source: Our Vision
ar_ly: رؤيتنا

# About_Vision_Description
source: To be the leading platform for student residence management, delivering seamless experiences for students, managers, and administrators worldwide through innovative technology and exceptional service delivery.
ar_ly: أن نكون المنصة الرائدة لإدارة مساكن الطلاب، وتقديم تجارب سلسة للطلاب والمديرين والإداريين في جميع أنحاء العالم من خلال التكنولوجيا المبتكرة وتقديم الخدمات الاستثنائية.

# About_Mission_Title
source: Our Mission
ar_ly: مهمتنا

# About_Mission_Description
source: To simplify and enhance the student housing experience by providing a comprehensive, user-friendly platform that connects students with quality accommodation while empowering administrators with powerful management tools.
ar_ly: تبسيط وتحسين تجربة السكن الطلابي من خلال توفير منصة شاملة وسهلة الاستخدام تربط الطلاب بسكن عالي الجودة مع تمكين الإداريين بأدوات إدارة قوية.

# About_WhyChooseSRMS_Title
source: Why Choose SRMS?
ar_ly: لماذا تختار SRMS؟

# About_Feature_FastEfficient_Title
source: Fast & Efficient
ar_ly: سريع وفعال

# About_Feature_FastEfficient_Description
source: Streamlined processes that save time and reduce administrative burden
ar_ly: عمليات مبسطة توفر الوقت وتقلل من الأعباء الإدارية

# About_Feature_MultiPlatform_Title
source: Multi-Platform
ar_ly: متعدد المنصات

# About_Feature_MultiPlatform_Description
source: Access from any device - desktop, tablet, or mobile
ar_ly: الوصول من أي جهاز - كمبيوتر مكتبي أو جهاز لوحي أو هاتف محمول

# About_Feature_247Support_Title
source: 24/7 Support
ar_ly: دعم على مدار الساعة

# About_Feature_247Support_Description
source: Round-the-clock customer support to assist you anytime
ar_ly: دعم عملاء على مدار الساعة لمساعدتك في أي وقت

# About_Feature_CloudBased_Title
source: Cloud-Based
ar_ly: قائم على السحابة

# About_Feature_CloudBased_Description
source: Scalable cloud infrastructure for optimal performance
ar_ly: بنية تحتية سحابية قابلة للتطوير لأداء مثالي

# About_Impact_Title
source: Our Impact
ar_ly: تأثيرنا

# About_Impact_UserRating
source: User Rating
ar_ly: تقييم المستخدم

# About_Team_Title
source: Meet Our Team
ar_ly: تعرف على فريقنا

# About_Team_Member1_Name
source: Dr. Sarah Johnson
ar_ly: د. سارة جونسون

# About_Team_Member1_Role
source: CEO
ar_ly: الرئيس التنفيذي

# About_Team_Member1_Description
source: Driving innovation in student housing
ar_ly: قيادة الابتكار في سكن الطلاب

# About_Team_Member2_Name
source: Michael Chen
ar_ly: مايكل تشين

# About_Team_Member2_Role
source: CTO
ar_ly: الرئيس التنفيذي للتكنولوجيا

# About_Team_Member2_Description
source: Building cutting-edge solutions
ar_ly: بناء حلول متطورة

# About_Team_Member3_Name
source: Emily Rodriguez
ar_ly: إميلي رودريغيز

# About_Team_Member3_Role
source: COO
ar_ly: رئيس العمليات

# About_Team_Member3_Description
source: Ensuring seamless experiences
ar_ly: ضمان تجارب سلسة

# About_Team_Member4_Name
source: David Kim
ar_ly: ديفيد كيم

# About_Team_Member4_Role
source: Customer Success Manager
ar_ly: مدير نجاح العملاء

# About_Team_Member4_Description
source: Dedicated to your satisfaction
ar_ly: مكرس لرضاك

# Contact_Address_Value
source: 123 University Ave, City, State 12345, Country
ar_ly: 123 شارع الجامعة، المدينة، الولاية 12345، الدولة

# Contact_BusinessHours_Value
source: Mon - Fri: 9am - 6pm, Sat: 10am - 4pm, Sun: Closed
ar_ly: الاثنين - الجمعة: 9:00 صباحًا - 6:00 مساءً، السبت: 10:00 صباحًا - 4:00 مساءً، الأحد: مغلق

# Register_PasswordStrength_NotSet
source: Not Set
ar_ly: لم يتم التعيين

# Register_PasswordStrength_VeryWeak
source: Very Weak
ar_ly: ضعيف جدا

# Register_PasswordStrength_Weak
source: Weak
ar_ly: ضعيف

# Register_PasswordStrength_Fair
source: Fair
ar_ly: مقبول

# Register_PasswordStrength_Good
source: Good
ar_ly: جيد

# Register_PasswordStrength_Strong
source: Strong
ar_ly: قوي

# Register_Snackbar_Success
source: Successfully registered! Please check your email to activate your account.
ar_ly: تم التسجيل بنجاح! يرجى التحقق من بريدك الإلكتروني لتفعيل حسابك.

# Register_Snackbar_Failure
source: Registration failed. Please try again.
ar_ly: فشل التسجيل. يرجى المحاولة مرة أخرى.

# Register_Snackbar_Error
source: Registration failed: {0}
ar_ly: فشل التسجيل: {0}

# Register_TermsAndConditions
source: I agree to the {0} and {1}
ar_ly: أوافق على {0} و {1}

# ForgotPassword_PageTitle
source: Forgot Password - SRMS
ar_ly: نسيت كلمة المرور - SRMS

# ForgotPassword_Header
source: Forgot Password?
ar_ly: نسيت كلمة المرور؟

# ForgotPassword_Subheader
source: No worries! Enter your email and we'll send you a reset link.
ar_ly: لا تقلق! أدخل بريدك الإلكتروني وسنرسل لك رابط إعادة التعيين.

# ForgotPassword_Label_Email
source: Email Address
ar_ly: عنوان البريد الإلكتروني

# ForgotPassword_Helper_Email
source: Enter the email address associated with your account
ar_ly: أدخل عنوان البريد الإلكتروني المرتبط بحسابك

# ForgotPassword_Button_Sending
source: Sending reset link...
ar_ly: جارٍ إرسال رابط إعادة التعيين...

# ForgotPassword_Button_Send
source: Send Reset Link
ar_ly: إرسال رابط إعادة التعيين

# ForgotPassword_Button_BackToLogin
source: Back to Login
ar_ly: العودة إلى تسجيل الدخول

# ForgotPassword_Success_Header
source: Check your email
ar_ly: تحقق من بريدك الإلكتروني

# ForgotPassword_Success_Subheader
source: We've sent a password reset link to <strong>{0}</strong>
ar_ly: لقد أرسلنا رابط إعادة تعيين كلمة المرور إلى <strong>{0}</strong>
