Repository: alhabib3031/StudentResidenceManagementSystemSRMS
Catalog: SRMS.WebUI.Server/Resources/Resource.*.resx
Languages: ar_ly

# CreateRoleDialog_Snackbar_Success
source: Role '{0}' created successfully!
ar_ly: تم إنشاء الدور '{0}' بنجاح!

# CreateRoleDialog_Snackbar_Failure
source: Failed to create role. Please try again.
ar_ly: فشل إنشاء الدور. يرجى المحاولة مرة أخرى.

# CreateUserDialog_Title
source: Create New User
ar_ly: إنشاء مستخدم جديد

# CreateUserDialog_SelectRole
source: Select Role
ar_ly: اختر الدور

# CreateUserDialog_Role_Admin
source: Admin
ar_ly: مسؤول

# CreateUserDialog_Role_Manager
source: Manager
ar_ly: مدير

# CreateUserDialog_Role_Student
source: Student
ar_ly: طالب

# CreateUserDialog_FirstName
source: First Name
ar_ly: الاسم الأول

# CreateUserDialog_LastName
source: Last Name
ar_ly: اسم العائلة

# CreateUserDialog_Email
source: Email Address
ar_ly: عنوان البريد الإلكتروني

# CreateUserDialog_PhoneNumber
source: Phone Number
ar_ly: رقم الهاتف

# CreateUserDialog_TempPassword
source: Temporary Password
ar_ly: كلمة مرور مؤقتة

# CreateUserDialog_TempPassword_Helper
source: User will be prompted to change password on first login
ar_ly: سيُطلب من المستخدم تغيير كلمة المرور عند تسجيل الدخول لأول مرة

# CreateUserDialog_ConfirmPassword
source: Confirm Password
ar_ly: تأكيد كلمة المرور

# CreateUserDialog_SendWelcomeEmail
source: Send welcome email with login credentials
ar_ly: إرسال بريد إلكتروني ترحيبي مع بيانات اعتماد تسجيل الدخول

# CreateUserDialog_Button_Cancel
source: Cancel
ar_ly: إلغاء

# CreateUserDialog_Button_Create
source: Create User
ar_ly: إنشاء مستخدم

# CreateUserDialog_Snackbar_Success
source: {0} account created successfully!
ar_ly: تم إنشاء حساب {0} بنجاح!

# CreateUserDialog_Snackbar_Failure
source: Failed to create user
ar_ly: فشل إنشاء المستخدم

# DatabaseToolsDialog_Title
source: Database Management Tools
ar_ly: أدوات إدارة قاعدة البيانات

# DatabaseToolsDialog_Warning
source: <strong>⚠️ Warning:</strong> These operations can affect your entire database. Use with extreme caution!
ar_ly: <strong>⚠️ تحذير:</strong> يمكن أن تؤثر هذه العمليات على قاعدة بياناتك بأكملها. استخدم بحذر شديد!

# DatabaseToolsDialog_Backup_Header
source: Database Backup
ar_ly: نسخ احتياطي لقاعدة البيانات

# DatabaseToolsDialog_Backup_Description
source: Create a full backup of your database for safekeeping.
ar_ly: إنشاء نسخة احتياطية كاملة من قاعدة البيانات الخاصة بك للحفاظ عليها.

# DatabaseToolsDialog_Backup_Button
source: Create Backup
ar_ly: إنشاء نسخة احتياطية

# DatabaseToolsDialog_Restore_Header
source: Database Restore
ar_ly: استعادة قاعدة البيانات

# DatabaseToolsDialog_Restore_Description
source: Restore your database from a previous backup file.
ar_ly: استعادة قاعدة البيانات الخاصة بك من ملف نسخ احتياطي سابق.

# DatabaseToolsDialog_Restore_Button_Select
source: Choose Backup File
ar_ly: اختر ملف النسخ الاحتياطي

# DatabaseToolsDialog_Restore_Button_Restore
source: Restore Now
ar_ly: استعادة الآن

# DatabaseToolsDialog_DangerZone_Header
source: Danger Zone
ar_ly: منطقة الخطر

# DatabaseToolsDialog_DangerZone_Description
source: <strong>⚠️ These actions are irreversible!</strong>
ar_ly: <strong>⚠️ هذه الإجراءات لا رجعة فيها!</strong>

# DatabaseToolsDialog_DangerZone_Button_Reset
source: Reset Database to Defaults
ar_ly: إعادة تعيين قاعدة البيانات إلى الإعدادات الافتراضية

# DatabaseToolsDialog_Button_Close
source: Close
ar_ly: إغلاق

# DatabaseToolsDialog_Snackbar_BackupCreating
source: Creating database backup...
ar_ly: جارٍ إنشاء نسخة احتياطية لقاعدة البيانات...

# DatabaseToolsDialog_Snackbar_BackupSuccess
source: ✅ Database backup created successfully! Saved to: Backups/{0}
ar_ly: ✅ تم إنشاء نسخة احتياطية لقاعدة البيانات بنجاح! تم الحفظ في: Backups/{0}

# DatabaseToolsDialog_Snackbar_BackupFailed
source: ❌ Backup creation failed.
ar_ly: ❌ فشل إنشاء النسخة الاحتياطية.

# DatabaseToolsDialog_Snackbar_SelectFile
source: Please select a backup file first.
ar_ly: الرجاء تحديد ملف نسخ احتياطي أولاً.

# DatabaseToolsDialog_Snackbar_RestoreConfirm
source: Are you sure you want to restore from '{0}'? This will overwrite all current data!
ar_ly: هل أنت متأكد أنك تريد الاستعادة من '{0}'؟ سيؤدي هذا إلى الكتابة فوق جميع البيانات الحالية!

# DatabaseToolsDialog_Snackbar_RestoreConfirm_Button
source: Restore
ar_ly: استعادة

# DatabaseToolsDialog_Snackbar_Restoring
source: Restoring database...
ar_ly: جارٍ استعادة قاعدة البيانات...

# DatabaseToolsDialog_Snackbar_RestoreSuccess
source: ✅ Database restored successfully!
ar_ly: ✅ تم استعادة قاعدة البيانات بنجاح!

# DatabaseToolsDialog_Snackbar_RestoreFailed
source: ❌ Database restore failed. Please check the backup file.
ar_ly: ❌ فشل استعادة قاعدة البيانات. يرجى التحقق من ملف النسخ الاحتياطي.

# DatabaseToolsDialog_Snackbar_ResetConfirm
source: ⚠️ Warning: This will delete all data and reset the database to factory defaults. Type 'RESET' to confirm.
ar_ly: ⚠️ تحذير: سيؤدي هذا إلى حذف جميع البيانات وإعادة تعيين قاعدة البيانات إلى إعدادات المصنع الافتراضية. اكتب 'RESET' للتأكيد.

# DatabaseToolsDialog_Snackbar_ResetConfirm_Button
source: I understand, Reset Now
ar_ly: أنا أفهم، أعد التعيين الآن

# DatabaseToolsDialog_Snackbar_Resetting
source: Resetting database...
ar_ly: جارٍ إعادة تعيين قاعدة البيانات...

# DatabaseToolsDialog_Snackbar_ResetSuccess
source: ✅ Database reset successfully!
ar_ly: ✅ تم إعادة تعيين قاعدة البيانات بنجاح!

# DatabaseToolsDialog_Snackbar_ResetFailed
source: ❌ Database reset failed.
ar_ly: ❌ فشل إعادة تعيين قاعدة البيانات.

# EditUserDialog_Title
source: Edit User
ar_ly: تعديل المستخدم

# EditUserDialog_FirstName
source: First Name
ar_ly: الاسم الأول

# EditUserDialog_LastName
source: Last Name
ar_ly: اسم العائلة

# EditUserDialog_PhoneNumber
source: Phone Number
ar_ly: رقم الهاتف

# EditUserDialog_City
source: City
ar_ly: المدينة

# EditUserDialog_Country
source: Country
ar_ly: الدولة

# EditUserDialog_Language
source: Language
ar_ly: اللغة

# EditUserDialog_Language_Arabic
source: Arabic (Libya)
ar_ly: العربية (ليبيا)

# EditUserDialog_Language_English
source: English (United States)
ar_ly: الإنجليزية (الولايات المتحدة)

# EditUserDialog_Theme
source: Theme
ar_ly: المظهر

# EditUserDialog_Theme_Light
source: Light
ar_ly: فاتح

# EditUserDialog_Theme_Dark
source: Dark
ar_ly: داكن

# EditUserDialog_Theme_System
source: System
ar_ly: النظام

# EditUserDialog_EnableEmailNotifications
source: Enable Email Notifications
ar_ly: تفعيل إشعارات البريد الإلكتروني

# EditUserDialog_EnableSMSNotifications
source: Enable SMS Notifications
ar_ly: تفعيل إشعارات الرسائل القصيرة

# EditUserDialog_Button_Cancel
source: Cancel
ar_ly: إلغاء

# EditUserDialog_Button_Save
source: Save Changes
ar_ly: حفظ التغييرات

# EditUserDialog_Snackbar_UserNotFound
source: User not found
ar_ly: المستخدم غير موجود

# EditUserDialog_Snackbar_LoadError
source: Error loading user: {0}
ar_ly: خطأ في تحميل المستخدم: {0}

# EditUserDialog_Snackbar_UpdateSuccess
source: User updated successfully!
ar_ly: تم تحديث المستخدم بنجاح!

# EditUserDialog_Snackbar_UpdateFailed
source: Failed to update user
ar_ly: فشل تحديث المستخدم

# ManageRolesDialog_Title
source: Manage Roles
ar_ly: إدارة الأدوار

# ManageRolesDialog_Description
source: Manage roles for the selected user.
ar_ly: إدارة الأدوار للمستخدم المحدد.

# ManageRolesDialog_Button_Cancel
source: Cancel
ar_ly: إلغاء

# ManageRolesDialog_Button_Save
source: Save Roles
ar_ly: حفظ الأدوار

# ManageRolesDialog_Snackbar_LoadError
source: Error loading roles: {0}
ar_ly: خطأ في تحميل الأدوار: {0}

# ManageRolesDialog_Snackbar_AddRoleFailed
source: Failed to add role: {0}
ar_ly: فشل إضافة الدور: {0}

# ManageRolesDialog_Snackbar_RemoveRoleFailed
source: Failed to remove role: {0}
ar_ly: فشل إزالة الدور: {0}

# ManageRolesDialog_Snackbar_UpdateSuccess
source: Roles updated successfully!
ar_ly: تم تحديث الأدوار بنجاح!

# RolesManagement.Title
source: Roles Management
ar_ly: إدارة الأدوار

# RolesManagement.Subtitle
source: Manage system roles and permissions
ar_ly: إدارة أدوار النظام والصلاحيات

# RolesManagement.CreateNewRole
source: Create New Role
ar_ly: إنشاء دور جديد

# RolesManagement.SystemRolesHeader
source: System Roles (read-only)
ar_ly: أدوار النظام (لا يمكن حذفها)

# RolesManagement.SystemChip
source: System
ar_ly: نظام

# RolesManagement.CustomRolesHeader
source: Custom Roles
ar_ly: الأدوار المخصصة

# RolesManagement.EditRole
source: Edit
ar_ly: تعديل

# RolesManagement.DeleteRole
source: Delete
ar_ly: حذف

# RolesManagement.CustomRoleDesc
source: Custom role created by administrator
ar_ly: دور مخصص تم إنشاؤه بواسطة المسؤول

# RolesManagement.ManagePermissions
source: Manage Permissions
ar_ly: إدارة الصلاحيات

# RolesManagement.NoCustomRoles
source: No custom roles yet.
ar_ly: لا توجد أدوار مخصصة.

# RolesManagement.ErrorLoadingRoles
source: Error loading roles
ar_ly: خطأ في تحميل الأدوار

# RolesManagement.EditRoleToast
source: Editing role '{0}' - coming soon!
ar_ly: تعديل الدور '{0}' - قريباً!

# RolesManagement.DeleteRoleConfirm
source: Are you sure you want to delete role '{0}'? This cannot be undone.
ar_ly: هل أنت متأكد أنك تريد حذف الدور '{0}'؟ سيؤدي ذلك إلى فقدان المستخدمين صلاحيات هذا الدور!

# RolesManagement.DeleteRoleSuccess
source: Role '{0}' deleted successfully!
ar_ly: تم حذف الدور '{0}' بنجاح!

# RolesManagement.DeleteRoleFailed
source: Failed to delete role '{0}'!
ar_ly: فشل حذف الدور '{0}'!

# RolesManagement.Desc.SuperRoot
source: Full system access with all admin permissions
ar_ly: وصول كامل للنظام مع كل صلاحيات الإدارة

# RolesManagement.Desc.Admin
source: Administrative privileges to manage residences and managers
ar_ly: صلاحيات إدارية لإدارة المساكن والمديرين

# RolesManagement.Desc.Manager
source: Manage students, rooms, complaints and payments
ar_ly: إدارة الطلاب، الغرف، الشكاوى، والمدفوعات

# RolesManagement.Desc.Student
source: Access to personal dashboard and submit complaints
ar_ly: الوصول إلى لوحة التحكم الشخصية وتقديم الشكاوى

# RolesManagement.Desc.Custom
source: Custom role
ar_ly: دور مخصص

# Permissions.Title
source: Permissions Management
ar_ly: إدارة الصلاحيات

# Permissions.Subtitle
source: Manage role permissions and access control
ar_ly: إدارة صلاحيات الأدوار والتحكم في الوصول

# Permissions.CreateCustom
source: Create Permission
ar_ly: إنشاء صلاحية

# Permissions.SelectRoleLabel
source: Select a role to manage
ar_ly: اختر الدور لإدارته

# Permissions.Search
source: Search for permissions
ar_ly: البحث عن صلاحيات

# Permissions.FilterByCategory
source: Filter by category
ar_ly: التصفية بحسب الفئة

# Permissions.Suffix
source: Permissions
ar_ly: صلاحيات

# Permissions.EnableAll
source: Enable All
ar_ly: تفعيل الكل

# Permissions.DisableAll
source: Disable All
ar_ly: تعطيل الكل

# Permissions.SaveAll
source: Save All Changes
ar_ly: حفظ جميع التغييرات

# Permissions.SavingChanges
source: Saving changes...
ar_ly: جارٍ حفظ التغييرات...

# Permissions.ErrorLoadingRoles
source: Error loading roles
ar_ly: خطأ في تحميل الأدوار

# Permissions.ErrorLoading
source: Error loading permissions: {0}
ar_ly: خطأ في تحميل الصلاحيات: {0}

# Permissions.SaveSuccess
source: Successfully saved permissions for {0} role!
ar_ly: تم حفظ الصلاحيات لدور {0} بنجاح!

# Permissions.SaveFailed
source: Failed to save permissions.
ar_ly: فشل في حفظ الصلاحيات.

# Permissions.Error
source: Error: {0}
ar_ly: خطأ: {0}

# Permissions.Category.Users
source: Users
ar_ly: المستخدمون

# Permissions.Category.Students
source: Students
ar_ly: الطلاب

# Permissions.Category.Managers
source: Managers
ar_ly: المديرون

# Permissions.Category.Rooms
source: Rooms
ar_ly: الغرف

# Permissions.Category.Payments
source: Payments
ar_ly: المدفوعات

# Permissions.Category.Complaints
source: Complaints
ar_ly: الشكاوى

# Permissions.Category.Residences
source: Residences
ar_ly: المساكن

# Permissions.Category.Assets
source: Assets
ar_ly: الأصول

# Permissions.Category.System
source: System
ar_ly: النظام

# Permissions.ViewUsers
source: View Users
ar_ly: عرض المستخدمين

# Permissions.ViewUsers.Desc
source: View all users in the system
ar_ly: عرض جميع المستخدمين في النظام

# Permissions.CreateUsers
source: Create Users
ar_ly: إنشاء مستخدمين

# Permissions.CreateUsers.Desc
source: Create new user accounts
ar_ly: إنشاء حسابات مستخدمين جديدة

# Permissions.EditUsers
source: Edit Users
ar_ly: تعديل المستخدمين

# Permissions.EditUsers.Desc
source: Modify user information
ar_ly: تعديل معلومات المستخدم

# Permissions.DeleteUsers
source: Delete Users
ar_ly: حذف المستخدمين

# Permissions.DeleteUsers.Desc
source: Delete user accounts
ar_ly: حذف حسابات المستخدمين

# Permissions.ManageUsers
source: Manage Users
ar_ly: إدارة المستخدمين

# Permissions.ManageUsers.Desc
source: Full user management permissions
ar_ly: صلاحيات إدارة المستخدمين الكاملة

# Permissions.ActivateUsers
source: Activate Users
ar_ly: تفعيل المستخدمين

# Permissions.ActivateUsers.Desc
source: Activate pending user accounts
ar_ly: تفعيل حسابات المستخدمين المعلقة

# Permissions.DeactivateUsers
source: Deactivate Users
ar_ly: تعطيل المستخدمين

# Permissions.DeactivateUsers.Desc
source: Deactivate user accounts
ar_ly: تعطيل حسابات المستخدمين

# Permissions.ViewStudents
source: View Students
ar_ly: عرض الطلاب

# Permissions.ViewStudents.Desc
source: View student profiles
ar_ly: عرض ملفات الطلاب

# Permissions.ViewOwnProfile
source: View Own Profile
ar_ly: عرض الملف الشخصي

# Permissions.ViewOwnProfile.Desc
source: View own student profile
ar_ly: عرض الملف الشخصي للطالب

# Permissions.EditStudents
source: Edit Students
ar_ly: تعديل الطلاب

# Permissions.EditStudents.Desc
source: Modify student information
ar_ly: تعديل معلومات الطلاب

# Permissions.EditOwnProfile
source: Edit Own Profile
ar_ly: تعديل الملف الشخصي

# Permissions.EditOwnProfile.Desc
source: Modify own student profile
ar_ly: تعديل الملف الشخصي للطالب

# Permissions.DeleteStudents
source: Delete Students
ar_ly: حذف الطلاب

# Permissions.DeleteStudents.Desc
source: Delete student records
ar_ly: حذف سجلات الطلاب

# Permissions.ManageStudents
source: Manage Students
ar_ly: إدارة الطلاب

# Permissions.ManageStudents.Desc
source: Full student management permissions
ar_ly: صلاحيات إدارة الطلاب الكاملة

# Permissions.ViewManagers
source: View Managers
ar_ly: عرض المديرين

# Permissions.ViewManagers.Desc
source: View manager profiles
ar_ly: عرض ملفات المديرين

# Permissions.CreateManagers
source: Create Managers
ar_ly: إنشاء مديرين

# Permissions.CreateManagers.Desc
source: Create new managers
ar_ly: إنشاء مديرين جدد

# Permissions.EditManagers
source: Edit Managers
ar_ly: تعديل المديرين

# Permissions.EditManagers.Desc
source: Modify manager information
ar_ly: تعديل معلومات المديرين

# Permissions.DeleteManagers
source: Delete Managers
ar_ly: حذف المديرين

# Permissions.DeleteManagers.Desc
source: Remove managers
ar_ly: إزالة المديرين

# Permissions.ManageManagers
source: Manage Managers
ar_ly: إدارة المديرين

# Permissions.ManageManagers.Desc
source: Full manager management permissions
ar_ly: صلاحيات إدارة المديرين الكاملة

# Permissions.ViewRooms
source: View Rooms
ar_ly: عرض الغرف

# Permissions.ViewRooms.Desc
source: View room information
ar_ly: عرض معلومات الغرف

# Permissions.CreateRooms
source: Create Rooms
ar_ly: إنشاء غرف

# Permissions.CreateRooms.Desc
source: Add new rooms
ar_ly: إضافة غرف جديدة

# Permissions.EditRooms
source: Edit Rooms
ar_ly: تعديل الغرف

# Permissions.EditRooms.Desc
source: Modify room details
ar_ly: تعديل تفاصيل الغرف

# Permissions.DeleteRooms
source: Delete Rooms
ar_ly: حذف الغرف

# Permissions.DeleteRooms.Desc
source: Remove rooms
ar_ly: إزالة الغرف

# Permissions.ManageRooms
source: Manage Rooms
ar_ly: إدارة الغرف

# Permissions.ManageRooms.Desc
source: Full room management permissions
ar_ly: صلاحيات إدارة الغرف الكاملة

# Permissions.AssignRooms
source: Assign Rooms
ar_ly: تعيين غرف

# Permissions.AssignRooms.Desc
source: Assign students to rooms
ar_ly: تعيين الطلاب إلى الغرف

# Permissions.ViewPayments
source: View Payments
ar_ly: عرض المدفوعات

# Permissions.ViewPayments.Desc
source: View payment records
ar_ly: عرض سجلات الدفع

# Permissions.ViewOwnPayments
source: View Own Payments
ar_ly: عرض المدفوعات الخاصة بي

# Permissions.ViewOwnPayments.Desc
source: View own payment history
ar_ly: عرض سجل مدفوعاتي

# Permissions.ViewAllPayments
source: View All Payments
ar_ly: عرض جميع المدفوعات

# Permissions.ViewAllPayments.Desc
source: View all payment records
ar_ly: عرض كل سجلات الدفع

# Permissions.RecordPayments
source: Record Payments
ar_ly: تسجيل المدفوعات

# Permissions.RecordPayments.Desc
source: Record new payments
ar_ly: تسجيل دفعات جديدة

# Permissions.EditPayments
source: Edit Payments
ar_ly: تعديل المدفوعات

# Permissions.EditPayments.Desc
source: Modify payment records
ar_ly: تعديل سجلات الدفع

# Permissions.DeletePayments
source: Delete Payments
ar_ly: حذف المدفوعات

# Permissions.DeletePayments.Desc
source: Remove payment records
ar_ly: إزالة سجلات الدفع

# Permissions.ViewComplaints
source: View Complaints
ar_ly: عرض الشكاوى

# Permissions.ViewComplaints.Desc
source: View complaints
ar_ly: عرض الشكاوى

# Permissions.ViewOwnComplaints
source: View Own Complaints
ar_ly: عرض شكاوي

# Permissions.ViewOwnComplaints.Desc
source: View own complaints
ar_ly: عرض شكاوي خاصة بي

# Permissions.SubmitComplaints
source: Submit Complaints
ar_ly: تقديم شكاوى

# Permissions.SubmitComplaints.Desc
source: Create new complaints
ar_ly: إنشاء شكاوى جديدة

# Permissions.EditComplaints
source: Edit Complaints
ar_ly: تعديل الشكاوى

# Permissions.EditComplaints.Desc
source: Modify complaints
ar_ly: تعديل الشكاوى

# Permissions.DeleteComplaints
source: Delete Complaints
ar_ly: حذف الشكاوى

# Permissions.DeleteComplaints.Desc
source: Remove complaints
ar_ly: إزالة الشكاوى

# Permissions.ManageComplaints
source: Manage Complaints
ar_ly: إدارة الشكاوى

# Permissions.ManageComplaints.Desc
source: Full complaint management permissions
ar_ly: صلاحيات إدارة الشكاوى الكاملة

# Permissions.ResolveComplaints
source: Resolve Complaints
ar_ly: حل الشكاوى

# Permissions.ResolveComplaints.Desc
source: Mark complaints as resolved
ar_ly: وضع علامة على الشكاوى كمحلولة

# Permissions.ViewResidences
source: View Residences
ar_ly: عرض المساكن

# Permissions.ViewResidences.Desc
source: View residence information
ar_ly: عرض معلومات السكن

# Permissions.CreateResidences
source: Create Residences
ar_ly: إنشاء مساكن

# Permissions.CreateResidences.Desc
source: Add new residences
ar_ly: إضافة مساكن جديدة

# Permissions.EditResidences
source: Edit Residences
ar_ly: تعديل المساكن

# Permissions.EditResidences.Desc
source: Modify residence details
ar_ly: تعديل تفاصيل المساكن

# Permissions.DeleteResidences
source: Delete Residences
ar_ly: حذف المساكن

# Permissions.DeleteResidences.Desc
source: Remove residences
ar_ly: إزالة المساكن

# Permissions.ManageResidence
source: Manage Residence
ar_ly: إدارة السكن

# Permissions.ManageResidence.Desc
source: Manage assigned residence
ar_ly: إدارة السكن المعين

# Permissions.ManageAllResidences
source: Manage All Residences
ar_ly: إدارة جميع المساكن

# Permissions.ManageAllResidences.Desc
source: Full management permissions for all residences
ar_ly: صلاحيات إدارة جميع المساكن

# Permissions.ViewAssets
source: View Assets
ar_ly: عرض الأصول

# Permissions.ViewAssets.Desc
source: View asset inventory
ar_ly: عرض جرد الأصول

# Permissions.CreateAssets
source: Create Assets
ar_ly: إنشاء أصول

# Permissions.CreateAssets.Desc
source: Add new assets
ar_ly: إضافة أصول جديدة

# Permissions.EditAssets
source: Edit Assets
ar_ly: تعديل الأصول

# Permissions.EditAssets.Desc
source: Modify asset details
ar_ly: تعديل تفاصيل الأصول

# Permissions.DeleteAssets
source: Delete Assets
ar_ly: حذف الأصول

# Permissions.DeleteAssets.Desc
source: Remove assets
ar_ly: إزالة الأصول

# Permissions.ManageAssets
source: Manage Assets
ar_ly: إدارة الأصول

# Permissions.ManageAssets.Desc
source: Full asset management permissions
ar_ly: صلاحيات إدارة الأصول الكاملة

# Permissions.ViewReports
source: View Reports
ar_ly: عرض التقارير

# Permissions.ViewReports.Desc
source: Access system reports
ar_ly: الوصول إلى تقارير النظام

# Permissions.SystemSettings
source: System Settings
ar_ly: إعدادات النظام

# Permissions.SystemSettings.Desc
source: Modify system settings
ar_ly: تعديل إعدادات النظام

# Permissions.ViewAuditLogs
source: View Audit Logs
ar_ly: عرض سجلات التدقيق

# Permissions.ViewAuditLogs.Desc
source: Access the audit log
ar_ly: الوصول إلى سجل التدقيق

# Permissions.SystemConfiguration
source: System Configuration
ar_ly: تكوين النظام

# Permissions.SystemConfiguration.Desc
source: Configure system parameters
ar_ly: تكوين معايير النظام

# Permissions.DatabaseManagement
source: Database Management
ar_ly: إدارة قاعدة البيانات

# Permissions.DatabaseManagement.Desc
source: Manage database operations
ar_ly: إدارة عمليات قاعدة البيانات

# UserManagement.Title
source: Users Management
ar_ly: إدارة المستخدمين

# UserManagement.Subtitle
source: Manage all system users and their roles
ar_ly: إدارة جميع مستخدمي النظام وأدوارهم

# UserManagement.CreateNewUser
source: Create New User
ar_ly: إنشاء مستخدم جديد

# UserManagement.SearchPlaceholder
source: Search
ar_ly: بحث

# UserManagement.FilterByRole
source: Filter by Role
ar_ly: تصفية حسب الدور

# UserManagement.Role.SuperRoot
source: SuperRoot
ar_ly: المسؤول الأعلى

# UserManagement.Role.Admin
source: Admin
ar_ly: مسؤول

# UserManagement.Role.Manager
source: Manager
ar_ly: مدير

# UserManagement.Role.Student
source: Student
ar_ly: طالب

# UserManagement.FilterByStatus
source: Filter by Status
ar_ly: تصفية حسب الحالة

# UserManagement.Status.ActiveOnly
source: Active Only
ar_ly: نشط فقط

# UserManagement.Status.InactiveOnly
source: Inactive Only
ar_ly: غير نشط فقط

# UserManagement.ApplyFilters
source: Apply Filters
ar_ly: تطبيق الفلاتر

# UserManagement.Table.Header.Avatar
source: Avatar
ar_ly: الصورة

# UserManagement.Table.Header.FullName
source: Full Name
ar_ly: الاسم الكامل

# UserManagement.Table.Header.Email
source: Email
ar_ly: البريد الإلكتروني

# UserManagement.Table.Header.Roles
source: Roles
ar_ly: الأدوار

# UserManagement.Table.Header.Status
source: Status
ar_ly: الحالة

# UserManagement.Table.Header.Created
source: Created
ar_ly: تاريخ الإنشاء

# UserManagement.Table.Header.LastLogin
source: Last Login
ar_ly: آخر تسجيل دخول

# UserManagement.Table.Header.Actions
source: Actions
ar_ly: الإجراءات

# AuditLogDetailsDialog_AdditionalInfo
source: Additional Information
ar_ly: معلومات إضافية

# AuditLogDetailsDialog_Button_Close
source: Close
ar_ly: إغلاق

# AuditLogDetailsDialog_ChangesSummary
source: Changes Summary
ar_ly: ملخص التغييرات

# AuditLogDetailsDialog_EntityId
source: Entity ID
ar_ly: مُعرِّف الكيان / هوية الكيان

# AuditLogDetailsDialog_EntityInfo
source: Entity Information
ar_ly: معلومات الكيان

# AuditLogDetailsDialog_EntityType
source: Entity Type
ar_ly: نوع الكيان

# AuditLogDetailsDialog_From
source: From: {0}
ar_ly: من: {0}

# AuditLogDetailsDialog_IpAddress
source: IP Address
ar_ly: عنوان بروتوكول الإنترنت

# AuditLogDetailsDialog_LogId
source: Log ID
ar_ly: مُعرِّف السجل

# AuditLogDetailsDialog_Metadata
source: Metadata
ar_ly: البيانات الوصفية (الميتاداتا)

# AuditLogDetailsDialog_NA
source: N/A
ar_ly: غير متوفر / لا ينطبق

# AuditLogDetailsDialog_NewValues
source: New Values
ar_ly: القيم الجديدة

# AuditLogDetailsDialog_OldValues
source: Old Values
ar_ly: القيم القديمة

# AuditLogDetailsDialog_System
source: System
ar_ly: النظام

# AuditLogDetailsDialog_Timestamp
source: Timestamp (UTC)
ar_ly: الطابع الزمني (بالتوقيت العالمي المنسق)

# AuditLogDetailsDialog_Title
source: Audit Log Details
ar_ly: تفاصيل سجل التدقيق

# AuditLogDetailsDialog_To
source: To: {0}
ar_ly: إلى: {0}

# AuditLogDetailsDialog_Unknown
source: Unknown
ar_ly: غير معروف

# AuditLogDetailsDialog_UserAgent
source: User Agent
ar_ly: وكيل المستخدم

# AuditLogDetailsDialog_UserId
source: User ID
ar_ly: مُعرِّف المستخدم

# AuditLogDetailsDialog_UserInfo
source: User Information
ar_ly: معلومات المستخدم
